{
  "id": "3-minute-monday-unavailable-men-gays-the-queen",
  "source": "chris_williamson",
  "title": "Is pop culture teaching women to choose emotionally unavailable men?",
  "author": "Chris Williamson",
  "date": null,
  "source_url": null,
  "topics": [
    "Unavailable",
    "Men",
    "Gays"
  ],
  "sections": [
    {
      "heading": "Introduction",
      "content": "Hi friend,\n\nGet my brand new Vol. 2 Reading List with 100 more books to read before you die for free.\n\n[Download Reading List Vol. 2 now.](\\\"htt\n\n**Is pop culture teaching women to choose emotionally unavailable men?**\n\nMaybe.\n\n“What’s the weirdest propaganda you feel like movies have tried to push on you in your lifetime?\n\nFor me, I grew up with tons and tons of movies that kept saying that the worst thing a man could be is a grownup.\n\nYou’d see a lot of love triangle romances where the guy you’re supposed to be rooting against, his only sin is that he is just kind of normal.\n\nHe’s got a job and stuff.\n\nBut then some other guy, a bad boy would come along and it doesn’t matter that he sleeps in his car.\n\nOr if both of the guys are financially stable, you’re supposed to root for the one that is less emotionally stable, the one that is more childlike.” — Jason Pargin\n\nModern romance culture isn’t just telling stories, it’s shaping selection criteria.\n\nAcross movies, media, and even mainstream dating advice, women are being subtly conditioned to seek out emotional unavailability and volatility as signs of desirability.\n\nThe result is a generation of women confusing conflict with compatibility, drama with depth, and brokenness with mystery.\n\nRather than choosing partners based on emotional maturity, shared values, or long-term compatibility, many are drawn to conflict, aloofness or unavailability.\n\n**It’s the “he’s hard to love, but I can fix him” fantasy packaged and repackaged in everything from films to novels.**\n\nIn The Notebook, Allie chooses Noah, the poor, impulsive, deeply emotional man, over Lon, her secure and respectable fiancé.\n\nConclusion? Stability is boring and true love is obsessive, chaotic and all-consuming.\n\nIn Titanic, the scene that makes you like Jack more than Rose’s wealthy fiancé Cal is that for fun, Cal just sits and has quiet conversations with his friends whereas when Jack has fun, he has big, loud parties and the movie portrays this as him living more authentically or living life to its fullest.\n\nBut he’s really just living like a teenager.\n\nHe has nothing to offer Rose in terms of reliability or safety, yet their brief, fiery connection is portrayed as more authentic than anything she could have had with her professional fiancé.\n\nIn Twilight, Edward Cullen is dangerous, obsessive, and emotionally tortured, and that’s precisely what makes him desirable.\n\n\"Bella’s rejection of the warm, grounded Jacob underscores the trope: safe is boring, danger is hot.\"\n\nBeauty and the Beast takes it further by literalising the fantasy; love turns rage and violence into virtue.\n\n\"Similarly, A Star is Born presents Ally’s rise and Jackson Maine’s spiral as tragically intertwined: her love is deepened, not diminished, by his unraveling.\"\n\nThis is a twist on The Byronic hero; a literary archetype based on the persona of poet Lord Byron.\n\nHe’s usually emotionally isolated or unavailable, often morally ambiguous or antiheroic, at odds with society or authority, possesses a tragic past or trauma, and women are often drawn to him despite his destructiveness.\n\nEven modern women’s advice keeps repackaging difficult as “passionate”.\n\nTeen Vogue runs headlines like “Super Bad: Why Are Smart Girls Drawn to Bad Boys?” The Sun gushes about “why the sexiest stars go for bad boys.”\n\n**The takeaway? If he’s cold, complicated, or broken, he must be worth it. Safety is sterile and suffering is sexy.**\n\nThere’s a neuroscience trick being played on us all here though…\n\n**Things that are valuable are often hard to get, but just because something is hard to get does not mean it is valuable.**\n\nWhich is how scarcity and unavailability are often mistaken for worth.\n\nRomance stories reward the woman who “wins” the affection of the aloof or emotionally damaged man.\n\nThe harder he is to access, the more meaningful his eventual affection feels.\n\nIn reality, sure perhaps there is a noble savage who can be saved by the right woman, but realistically this just prioritises partners who are not capable of commitment over ones who are already put together and ready to go.\n\n**Typically, this coyness isn’t love, it’s emotional immaturity masquerading as a romantic spark.**\n\nThe problem is that intermittent reinforcement is the exact mechanism that drives addiction.\n\nYou’re not in love, you’re hooked.\n\nVariable schedule reward is the bullseye of dopamine.\n\nIt’s how slot machines, work and why social media is so compelling.\n\nOur brain says “If something is scarce, it must be more precious.”\n\nWe take this economic dynamic into our love lives.\n\nSo if someone stops texting us or feels like they’re drifting, all of a sudden our brain says “they must be important”.\n\nIf they say “here I am, I genuinely like you and very much want to commit”, our brain responds with “what’s wrong with you?”\n\n“You treat me like crap and you’re in & out of my life, you text me a bit and then you go cold and I don’t hear from you???” – they might be the one!\n\nIt’s no coincidence then that so many modern relationships don’t begin with mutual understanding, but with a chase.\n\n**We’ve taught women to interpret emotional inconsistency as romantic tension.**\n\nTo pursue the man who offers breadcrumbs of affection instead of consistent support.\n\nTo believe that love is meant to be hard-earned, not freely given.\n\nAnd this has real consequences – it normalises dysfunction, it rewires attraction around trauma, it sidelines healthy men and glorifies emotionally stunted ones, and it leaves women feeling like emotional burnout is the price they must pay for passion.\n\nEmotionally mature, transparently keen and immediately available men are ignored in place of someone who amounts to little more than an effective dopamine trigger.\n\n**This is why so many guys have so little sympathy for the “where are all the good men at?” question.**\n\nWhether through painful personal experience or by being subliminally reminded of it in pop culture, men who are ready to commit are fearful of doing so because they’e noticed that many women seem to like them more and soften up when they are mistreated and kept guessing.\n\n“I’m trapped in a generation where I don’t know whether to buy her flowers or ignore her to get her to like me.” — some dude on Instagram\n\n**Men will do what women demand of them in order to get laid.**\n\nWomen set the standards for sex, men meet them.\n\n“Although this may be considered an unflattering characterisation…we have found no evidence to contradict the basic general principle that men will do whatever is required in order to obtain sex, and perhaps not a great deal more.\n\nOne of us characterised this in a previous work as, ‘If women would stop sleeping with jerks, men would stop being jerks.’\n\nIf in order to obtain sex men must become pillars of the community, or lie, or amass riches by fair means or foul, or be romantic or funny, then many men will do precisely that.” — Roy Baumeister\n\n**Similarly, if men need to be broken, flaky, non-committal and inconsistent, then they will meet these standards appropriately.**\n\nWomen’s mate choices, modern romance culture and girl magazines are not at fault for emotionally unavailable behaviour in men, but they’re not totally unrelated to it either.\n\nWhat is needed is a clearer picture of healthy connection…\n\n**“It can take a very long time indeed for some of us to come to a highly basic-sounding realisation: we should only contemplate going out with people who are very enthusiastic about us.**\n\nFrom the start.\n\nWithout the need for persuasion.\n\nWithout any call for begging or chasing or strategic withholding of affection or visits to therapy.\n\nJust plainly and simply keen, open and ready; from the get go.\n\nWe may tolerate a prospective partner who tells us that they like us a lot but that they will only be available to see us again in a month, or someone who casually mentions they are presently trying to decide between us and three other suitors or a compelling career abroad.\n\nOr someone who can never bring themselves to initiate sex or hold our hand in public.\n\nA bit deeper into our relationships, we may similarly not spot that it might be less than ideal to be trying to convince someone that they should go into therapy so that they’ll (finally) see that they want us or that we are – in fact – just as much ‘fun’ to spend Saturday evenings with as their friends or their jobs.\n\n**To cut through the nonsense, we may be in need of a robust awakening.**\n\n**The only person we should for a moment ever contemplate being with is someone who, at the start of the journey, can already be at the table with a conviction to match our own.**\n\nWe can be forgiven for being (for a long time) deeply charmed by all the others, those who are coy and troubled, those who don’t reply to our messages and those whose difficult childhoods render them enchantingly off kilter.\n\nBut this is a game we can, in the end, ill afford.\n\n**It isn’t love if you need to keep messaging and they rarely reply.**\n\n**It isn’t love if they are evasive or surreptitiously liking someone else’s posts.**\n\n**It isn’t love if they get defensive or describe your legitimate requirements for attention as “too intense”.**\n\nWe need to get the wavering, defended ones out of our lives immediately; that will mean ejecting the majority of people we meet.\n\nAll the more reason to focus on the very few with native enthusiasm.\n\nWe need to hone our skills at recognising the keen ones and clear everyone else out of the way.\n\nStop imagining that they might be ‘shy’ or that you haven’t made your intentions clear enough.\n\n**Let’s say it again for good measure: the only worthwhile lovers are those who don’t need persuading.**\n\n**Those who like us a lot, already.**\n\n**Those who never leave us wondering where they might be or when they might reply.**\n\n**Those whose commitment to us flows easily so that all the focus can be on the difficulties of day-to-day living.**\n\nThe day to day living of life is tough enough without the difficulty of convincing someone to commit to us in a way that we are already prepared to commit to them.\n\nThe others may be fascinating, lovely looking, about to change their minds in fifteen-and-a-half years, after a trip to India, capable of generating lots of late-night arguments and ideal for a movie or psychoanalytic case study; they’re also just a plain waste of our precious time.” — The School Of Life\n\n— h/t Jason Pargin, Alain de Botton & Matthew Hussey. Plus that guy on Instagram."
    },
    {
      "heading": "MODERN WISDOM",
      "content": "**MODERN WISDOM**\n\nI do a podcast where I pretend to have a British accent.\n\n**This week’s upcoming episodes:**\n\nMonday. Rory Sutherland – a living legend returns for his eighth episode. Economics, marketing, branding, airports, Gary’s Economics and so much more. Listen now on[Spotify](\\\"htt\n\nThursday. Joe Folley – why does everyone love Existential Philosophy, Nietzsche, absurdism, Camus and Sisyphus. If you feel horribly under-educated in these areas, so did I. This is for you.\n\nSaturday. James Bloodworth – a multi-year journey through the Manosphere. What is happening with the ascendency of Red Pill, Pickup Artists, Feminism backlash and more."
    },
    {
      "heading": "THINGS I’VE LEARNED",
      "content": "**THINGS I’VE LEARNED**\n\n1.**Turn gay if you want to be well educated.**\n\nEveryone knows that men now earn fewer degrees than women.\n\nBut here’s an interesting twist: Gay men earn more degrees than any other demographic (including straight women).\n\nRoughly 52% of gay men in the US have a bachelor’s degree, compared to 36% of all adults and about 35% of straight men.\n\nInterestingly, lesbians and bisexual women earn fewer degrees than any other demographic (including straight men).\n\nThe researcher observed “if America’s gay men… formed their own country, it would be the world’s most highly educated by far.” — h/t Steve Stewart-Williams\n\n2. **Men and women want different things.**\n\n“72% of women (n = 1018) would prefer to sleep with a person they find unattractive but the person finds them attractive.\n\nWhereas 75% of men (n = 6576) would prefer to sleep with a person they find attractive, but the person finds them unattractive.” — Rob Henderson\n\n3. **It sucks to not be liked. But it sucks more to not be yourself.**\n\n“The Queen of England died 18 months ago….\n\nShe ruled an entire nation and accumulated more wealth than 99.99% of humans…\n\nAnd…yet…you haven’t thought about her except for right now.\n\nNo matter how big your dreams.\n\nYou’re gonna die.\n\nEveryone will move on.\n\nDo what you want.” — Alex Hormozi"
    },
    {
      "heading": "LIFE HACK",
      "content": "**Neutonic’s new Blue Raspberry flavour.**\n\nEvidence-based performance enhancement for your brain.\n\n[Get some now.](\\\"htt\n\nBig love, Chris x"
    }
  ],
  "main_content": "Hi friend,\n\nGet my brand new Vol. 2 Reading List with 100 more books to read before you die for free.\n\n[Download Reading List Vol. 2 now.](\\\"htt\n\n**Is pop culture teaching women to choose emotionally unavailable men?**\n\nMaybe.\n\n“What’s the weirdest propaganda you feel like movies have tried to push on you in your lifetime?\n\nFor me, I grew up with tons and tons of movies that kept saying that the worst thing a man could be is a grownup.\n\nYou’d see a lot of love triangle romances where the guy you’re supposed to be rooting against, his only sin is that he is just kind of normal.\n\nHe’s got a job and stuff.\n\nBut then some other guy, a bad boy would come along and it doesn’t matter that he sleeps in his car.\n\nOr if both of the guys are financially stable, you’re supposed to root for the one that is less emotionally stable, the one that is more childlike.” — Jason Pargin\n\nModern romance culture isn’t just telling stories, it’s shaping selection criteria.\n\nAcross movies, media, and even mainstream dating advice, women are being subtly conditioned to seek out emotional unavailability and volatility as signs of desirability.\n\nThe result is a generation of women confusing conflict with compatibility, drama with depth, and brokenness with mystery.\n\nRather than choosing partners based on emotional maturity, shared values, or long-term compatibility, many are drawn to conflict, aloofness or unavailability.\n\n**It’s the “he’s hard to love, but I can fix him” fantasy packaged and repackaged in everything from films to novels.**\n\nIn The Notebook, Allie chooses Noah, the poor, impulsive, deeply emotional man, over Lon, her secure and respectable fiancé.\n\nConclusion? Stability is boring and true love is obsessive, chaotic and all-consuming.\n\nIn Titanic, the scene that makes you like Jack more than Rose’s wealthy fiancé Cal is that for fun, Cal just sits and has quiet conversations with his friends whereas when Jack has fun, he has big, loud parties and the movie portrays this as him living more authentically or living life to its fullest.\n\nBut he’s really just living like a teenager.\n\nHe has nothing to offer Rose in terms of reliability or safety, yet their brief, fiery connection is portrayed as more authentic than anything she could have had with her professional fiancé.\n\nIn Twilight, Edward Cullen is dangerous, obsessive, and emotionally tortured, and that’s precisely what makes him desirable.\n\n\"Bella’s rejection of the warm, grounded Jacob underscores the trope: safe is boring, danger is hot.\"\n\nBeauty and the Beast takes it further by literalising the fantasy; love turns rage and violence into virtue.\n\n\"Similarly, A Star is Born presents Ally’s rise and Jackson Maine’s spiral as tragically intertwined: her love is deepened, not diminished, by his unraveling.\"\n\nThis is a twist on The Byronic hero; a literary archetype based on the persona of poet Lord Byron.\n\nHe’s usually emotionally isolated or unavailable, often morally ambiguous or antiheroic, at odds with society or authority, possesses a tragic past or trauma, and women are often drawn to him despite his destructiveness.\n\nEven modern women’s advice keeps repackaging difficult as “passionate”.\n\nTeen Vogue runs headlines like “Super Bad: Why Are Smart Girls Drawn to Bad Boys?” The Sun gushes about “why the sexiest stars go for bad boys.”\n\n**The takeaway? If he’s cold, complicated, or broken, he must be worth it. Safety is sterile and suffering is sexy.**\n\nThere’s a neuroscience trick being played on us all here though…\n\n**Things that are valuable are often hard to get, but just because something is hard to get does not mean it is valuable.**\n\nWhich is how scarcity and unavailability are often mistaken for worth.\n\nRomance stories reward the woman who “wins” the affection of the aloof or emotionally damaged man.\n\nThe harder he is to access, the more meaningful his eventual affection feels.\n\nIn reality, sure perhaps there is a noble savage who can be saved by the right woman, but realistically this just prioritises partners who are not capable of commitment over ones who are already put together and ready to go.\n\n**Typically, this coyness isn’t love, it’s emotional immaturity masquerading as a romantic spark.**\n\nThe problem is that intermittent reinforcement is the exact mechanism that drives addiction.\n\nYou’re not in love, you’re hooked.\n\nVariable schedule reward is the bullseye of dopamine.\n\nIt’s how slot machines, work and why social media is so compelling.\n\nOur brain says “If something is scarce, it must be more precious.”\n\nWe take this economic dynamic into our love lives.\n\nSo if someone stops texting us or feels like they’re drifting, all of a sudden our brain says “they must be important”.\n\nIf they say “here I am, I genuinely like you and very much want to commit”, our brain responds with “what’s wrong with you?”\n\n“You treat me like crap and you’re in & out of my life, you text me a bit and then you go cold and I don’t hear from you???” – they might be the one!\n\nIt’s no coincidence then that so many modern relationships don’t begin with mutual understanding, but with a chase.\n\n**We’ve taught women to interpret emotional inconsistency as romantic tension.**\n\nTo pursue the man who offers breadcrumbs of affection instead of consistent support.\n\nTo believe that love is meant to be hard-earned, not freely given.\n\nAnd this has real consequences – it normalises dysfunction, it rewires attraction around trauma, it sidelines healthy men and glorifies emotionally stunted ones, and it leaves women feeling like emotional burnout is the price they must pay for passion.\n\nEmotionally mature, transparently keen and immediately available men are ignored in place of someone who amounts to little more than an effective dopamine trigger.\n\n**This is why so many guys have so little sympathy for the “where are all the good men at?” question.**\n\nWhether through painful personal experience or by being subliminally reminded of it in pop culture, men who are ready to commit are fearful of doing so because they’e noticed that many women seem to like them more and soften up when they are mistreated and kept guessing.\n\n“I’m trapped in a generation where I don’t know whether to buy her flowers or ignore her to get her to like me.” — some dude on Instagram\n\n**Men will do what women demand of them in order to get laid.**\n\nWomen set the standards for sex, men meet them.\n\n“Although this may be considered an unflattering characterisation…we have found no evidence to contradict the basic general principle that men will do whatever is required in order to obtain sex, and perhaps not a great deal more.\n\nOne of us characterised this in a previous work as, ‘If women would stop sleeping with jerks, men would stop being jerks.’\n\nIf in order to obtain sex men must become pillars of the community, or lie, or amass riches by fair means or foul, or be romantic or funny, then many men will do precisely that.” — Roy Baumeister\n\n**Similarly, if men need to be broken, flaky, non-committal and inconsistent, then they will meet these standards appropriately.**\n\nWomen’s mate choices, modern romance culture and girl magazines are not at fault for emotionally unavailable behaviour in men, but they’re not totally unrelated to it either.\n\nWhat is needed is a clearer picture of healthy connection…\n\n**“It can take a very long time indeed for some of us to come to a highly basic-sounding realisation: we should only contemplate going out with people who are very enthusiastic about us.**\n\nFrom the start.\n\nWithout the need for persuasion.\n\nWithout any call for begging or chasing or strategic withholding of affection or visits to therapy.\n\nJust plainly and simply keen, open and ready; from the get go.\n\nWe may tolerate a prospective partner who tells us that they like us a lot but that they will only be available to see us again in a month, or someone who casually mentions they are presently trying to decide between us and three other suitors or a compelling career abroad.\n\nOr someone who can never bring themselves to initiate sex or hold our hand in public.\n\nA bit deeper into our relationships, we may similarly not spot that it might be less than ideal to be trying to convince someone that they should go into therapy so that they’ll (finally) see that they want us or that we are – in fact – just as much ‘fun’ to spend Saturday evenings with as their friends or their jobs.\n\n**To cut through the nonsense, we may be in need of a robust awakening.**\n\n**The only person we should for a moment ever contemplate being with is someone who, at the start of the journey, can already be at the table with a conviction to match our own.**\n\nWe can be forgiven for being (for a long time) deeply charmed by all the others, those who are coy and troubled, those who don’t reply to our messages and those whose difficult childhoods render them enchantingly off kilter.\n\nBut this is a game we can, in the end, ill afford.\n\n**It isn’t love if you need to keep messaging and they rarely reply.**\n\n**It isn’t love if they are evasive or surreptitiously liking someone else’s posts.**\n\n**It isn’t love if they get defensive or describe your legitimate requirements for attention as “too intense”.**\n\nWe need to get the wavering, defended ones out of our lives immediately; that will mean ejecting the majority of people we meet.\n\nAll the more reason to focus on the very few with native enthusiasm.\n\nWe need to hone our skills at recognising the keen ones and clear everyone else out of the way.\n\nStop imagining that they might be ‘shy’ or that you haven’t made your intentions clear enough.\n\n**Let’s say it again for good measure: the only worthwhile lovers are those who don’t need persuading.**\n\n**Those who like us a lot, already.**\n\n**Those who never leave us wondering where they might be or when they might reply.**\n\n**Those whose commitment to us flows easily so that all the focus can be on the difficulties of day-to-day living.**\n\nThe day to day living of life is tough enough without the difficulty of convincing someone to commit to us in a way that we are already prepared to commit to them.\n\nThe others may be fascinating, lovely looking, about to change their minds in fifteen-and-a-half years, after a trip to India, capable of generating lots of late-night arguments and ideal for a movie or psychoanalytic case study; they’re also just a plain waste of our precious time.” — The School Of Life\n\n— h/t Jason Pargin, Alain de Botton & Matthew Hussey. Plus that guy on Instagram.\n\n## MODERN WISDOM\n\n**MODERN WISDOM**\n\nI do a podcast where I pretend to have a British accent.\n\n**This week’s upcoming episodes:**\n\nMonday. Rory Sutherland – a living legend returns for his eighth episode. Economics, marketing, branding, airports, Gary’s Economics and so much more. Listen now on[Spotify](\\\"htt\n\nThursday. Joe Folley – why does everyone love Existential Philosophy, Nietzsche, absurdism, Camus and Sisyphus. If you feel horribly under-educated in these areas, so did I. This is for you.\n\nSaturday. James Bloodworth – a multi-year journey through the Manosphere. What is happening with the ascendency of Red Pill, Pickup Artists, Feminism backlash and more.\n\n## THINGS I’VE LEARNED\n\n**THINGS I’VE LEARNED**\n\n1.**Turn gay if you want to be well educated.**\n\nEveryone knows that men now earn fewer degrees than women.\n\nBut here’s an interesting twist: Gay men earn more degrees than any other demographic (including straight women).\n\nRoughly 52% of gay men in the US have a bachelor’s degree, compared to 36% of all adults and about 35% of straight men.\n\nInterestingly, lesbians and bisexual women earn fewer degrees than any other demographic (including straight men).\n\nThe researcher observed “if America’s gay men… formed their own country, it would be the world’s most highly educated by far.” — h/t Steve Stewart-Williams\n\n2. **Men and women want different things.**\n\n“72% of women (n = 1018) would prefer to sleep with a person they find unattractive but the person finds them attractive.\n\nWhereas 75% of men (n = 6576) would prefer to sleep with a person they find attractive, but the person finds them unattractive.” — Rob Henderson\n\n3. **It sucks to not be liked. But it sucks more to not be yourself.**\n\n“The Queen of England died 18 months ago….\n\nShe ruled an entire nation and accumulated more wealth than 99.99% of humans…\n\nAnd…yet…you haven’t thought about her except for right now.\n\nNo matter how big your dreams.\n\nYou’re gonna die.\n\nEveryone will move on.\n\nDo what you want.” — Alex Hormozi\n\n## LIFE HACK\n\n**Neutonic’s new Blue Raspberry flavour.**\n\nEvidence-based performance enhancement for your brain.\n\n[Get some now.](\\\"htt",
  "word_count": 2135,
  "reading_time_minutes": 11
}