{
  "id": "3-minute-monday-2024-candidates-butterflies",
  "source": "chris_williamson",
  "title": "If you would like to get me a belated Christmas present, all I’d ask of you is to send some episodes you enjoyed most to a few friends that you think would enjoy them – it’s the best way the show grow",
  "author": "Chris Williamson",
  "date": null,
  "source_url": null,
  "topics": [
    "2024",
    "Candidates",
    "Butterflies"
  ],
  "sections": [
    {
      "heading": "Introduction",
      "content": "Hi friend,\nBelow is a list of the Top 10 most played episodes on audio of 2024, in order.\nPerhaps unsurprisingly, that epic Matthew McConaughey episode came in at #1, it’s still so so good.\nIt’s great to see such a range of topics performing well, I love how varied I can go with the show and everyone still enjoy it.\nAnyway, all the links for Spotify and Apple Podcasts are below, go back and check some of these monsters out.\n**If you would like to get me a belated Christmas present, all I’d ask of you is to send some episodes you enjoyed most to a few friends that you think would enjoy them – it’s the best way the show grows!**\n**And give Modern Wisdom a 5* Review on  ****Apple Podcasts****  and ****Spotify**** **\nA massive thank you to everyone that’s been sharing and supporting the show throughout this year, Spotify said Modern Wisdom is in the top 1% of all shows shared in 2024. The squad is strong.\nHappy new year everyone. Enjoy the holidays!\n\n**Modern Wisdom Top 10 Episodes (2024)**\n10 – #780 – Tim Ferriss – The Lessons, Hacks & Books That Changed My Life\nhtt"
    },
    {
      "heading": "MODERN WISDOM",
      "content": "I do a podcast where I pretend to have a British accent. You should subscribe on Apple Podcasts or Spotify.\n\n**This week’s upcoming episodes:**\nMonday.\nDr Matthew Walker – one of the world’s best known sleep doctors gives his favourite hacks and ways to optimise rest & recovery.\nThursday.\nNick Pollard – The People Displeaser talks all things assertiveness, putting yourself first and how to stop trying to make everyone else happy. So so good.\nSaturday.\nAdam Grant – one of the best known psychologists on overcoming self-doubt, fear of failure, where confidence comes from and more."
    },
    {
      "heading": "THINGS I’VE LEARNED",
      "content": "1.\n**Do voters discriminate against female candidates?**\n“A meta-analysis of 67 experiments covering 120,601 people from six continents found that, in general, the answer is no.\nOn the contrary, people often prefer female candidates to otherwise identical males.\nBreaking the results down by sex, women were strongly biased in favor of female candidates, whereas men were just a little biased in favor of female candidates.\nThe authors note that “Our results add to the growing body of experimental and observational evidence that voter preferences are not a major factor explaining the persistently low rates of women in elected office.” — Steve Stewart-Williams\n\n2.\n**You don’t need butterflies in your stomach, you need someone who calms your nervous system.**\n“It’s funny how the warning signs can feel like they’re butterflies.” — Halsey\n\n3.\n**Pop psychology in a nutshell.**\n“If someone you like did something bad, it’s because they have Trauma.\nIf someone you dislike did something bad, it’s because they’re a Narcissist.\nIf someone disagrees with this, they’re Gaslighting.” — Gurwinder Bhogal"
    },
    {
      "heading": "LIFE HACK",
      "content": "**Some of the highest ROI resolutions I ever made:**\nNo phone in the bedroom at night, charge it outside.\nRead for 10 minutes a day.\nNo alcohol for 6 months.\nMorning walk every day.\nNo caffeine within 90 minutes of waking or after 1pm.\nNever miss a habit 2 days in a row.\nMost of those are still with me.\n\nBig love,\nChris x"
    }
  ],
  "main_content": "Hi friend,\nBelow is a list of the Top 10 most played episodes on audio of 2024, in order.\nPerhaps unsurprisingly, that epic Matthew McConaughey episode came in at #1, it’s still so so good.\nIt’s great to see such a range of topics performing well, I love how varied I can go with the show and everyone still enjoy it.\nAnyway, all the links for Spotify and Apple Podcasts are below, go back and check some of these monsters out.\n**If you would like to get me a belated Christmas present, all I’d ask of you is to send some episodes you enjoyed most to a few friends that you think would enjoy them – it’s the best way the show grows!**\n**And give Modern Wisdom a 5* Review on  ****Apple Podcasts****  and ****Spotify**** **\nA massive thank you to everyone that’s been sharing and supporting the show throughout this year, Spotify said Modern Wisdom is in the top 1% of all shows shared in 2024. The squad is strong.\nHappy new year everyone. Enjoy the holidays!\n\n**Modern Wisdom Top 10 Episodes (2024)**\n10 – #780 – Tim Ferriss – The Lessons, Hacks & Books That Changed My Life\nhtt",
  "word_count": 201,
  "reading_time_minutes": 1
}