{
  "id": "how-ordinary-people-get-rich-on-the-internet-in-2025",
  "source": "tim_denning",
  "title": "How Ordinary People Get Rich on the Internet in 2025",
  "author": "Tim Denning",
  "date": null,
  "source_url": "https://timdenning.substack.com/p/how-ordinary-people-get-rich-on-the",
  "topics": [
    "Ordinary",
    "People",
    "Get",
    "Rich",
    "Internet"
  ],
  "sections": [
    {
      "heading": "Main",
      "content": "# How Ordinary People Get Rich on the Internet in 2025\n\n### The game has changed\n\nShare\n\nEveryone wants to get rich on the internet.\n\nIt’s replaced the previous American Dream of climbing the corporate ladder to earn enough money to buy a house with a white picket fence and an SUV.\n\nOne of the most popular careers now is simply “Youtuber.” On the surface, it looks like a boring game to get famous. When you look beneath, like I have, you realize the driver of these new careers is something else.\n\nPeople want meaning.People want ownership.People want to make their side hustle their main gig.\n\nThis never used to be possible before the internet. Why? Because you needed distribution to take a passion for BBQing steaks and turn it into a full-time income. That meant impressing gatekeepers and doing a lot of underpaid or even free work.\n\nFacebook, Instagram, TikTok, and Youtube changed all of that. The built-in distribution means you can take any idea and reach enough people to own a one-person (or bigger) business.\n\n# Getting rich online has radically changed (and 90% of people have no clue)\n\nThe internet has now hard forked into a new era.\n\nBecause most people don’t know, they’re still chasing old ways of making money online which mostly don’t work anymore. I’ve been doing this for 11 years every day. Let me explain the difference between before and now.\n\n### 1. The naughty secret creators don’t want you to know\n\nMany of the people you look up to online faked their audience growth.\n\nWait, what? Yep. Most of them won't admit it. How did they do it?\n\n* Buying followers\n* Paying people to like/comment on their content\n* Engagement pods\n\nBuying followers\n\nPaying people to like/comment on their content\n\nEngagement pods\n\nEvery time I confront any creator behind the scenes they deny this. Yet it’s easy for me to spot because I can see who is engaging with their content and I know which accounts are selling commenting as a service.\n\nI don’t fundamentally think this practice is bad.\n\nIt’s not that much different than buying ads. What blows people’s minds is I haven’t engaged in this myself. I came from an earlier iteration of the internet, where if you wrote good headlines with helpful content, that was enough.\n\nI’d have way more followers if I bought engagement. I’m so glad I didn’t. Fame is a nightmare, and having millions of followers would have likely turned me into some sort of Tim Ferriss video game character.\n\nIn 2025, buying engagement is far less effective.\n\nThe social media algorithms have gotten smarter. They can filter out engagement buyers and even ban them. And “for you” feeds mean that ideas go viral no matter a person’s audience size.\n\n### 2. The era of “info products” is dead\n\nA few years ago you could sell a book or a course and become a millionaire.\n\nThat’s exactly what happened to me. Specific information used to be unique and highly desirable. Men would throw their G-strings on your social media stage to get access to your “growth guide.\"\n\nThe game got old.\n\nWhy? People no longer need more information. They’ve realized they need more action. The other significant change is the sheer amount of information online. Since the introduction of AI in 2022 the internet is being clogged up with content sludge generated by lazy “content creators.”\n\nWe now have the opposite problem: too much information.\n\nWe’re drowning in information.\n\nThe solution has been curation of information, and that’s why paid newsletters created a generational shift. We’d now rather pay for a newsletter than consume hours of free surface-level content that puts us to sleep or is full of infomercials.\n\nWhat’s bizarre is the message that info products are dead hasn’t become mainstream. Delusional people still think the mass market is going to buy their $20 ebook by the millions.\n\nI can only see info products are dead because 1) I run a info product side business 2) my closest friends run info product businesses and have seen 50%+ drops in sales.\n\n### 3. Followers mean nothing\n\nIt used to be cool to have 100k followers. Now it’s meaningless.\n\nSomeone can click the follow button once on your profile, then never see your content again. Followers aren’t special. And people that focused on followers are now realizing they’re useless when they come to monetize.\n\nWe’ve all heard stories of the guy who has 1M followers and can’t sell 5 t-shirts.\n\nOwned audiences are now all that matters. That means having an email list. But even that is shifting. The next level beyond an email list is a paid member-only community.\n\nBeing fixated on followers is preventing a lot of people from getting rich in the AI era of the internet.\n\n# Why get rich online\n\nGetting rich online sounds like an incredibly shallow goal.\n\nThe reason ordinary people are doing it has nothing to do with money or Lambos. It has to do with freedom.\n\nIt’s why all the flexing of luxury on Instagram is becoming boring and people are losing interest.\n\nWhen you think of getting rich online you might think of someone like Dan Koe. While he’s cool and making incredible amounts of money, the people I’m talking about in this essay are different.\n\nThey don’t have huge audiences. You likely have never heard of any of them. They’re ordinary people with no special talent. They’re social proof is minimal.\n\nHow did I meet these people? 1) Through my online business 2) by being a guest teacher in other creators’ masterminds.\n\nI didn’t intend this to happen. It just did. Before this shift occurred I was mainly interacting with 1M+ follower creators, but not anymore.\n\nWhy do these ordinary people get rich online? They’re early. They’ve accidentally become part of the future. When you’re early to a trend as big as this, you get unfair and outsized rewards.\n\nThe same happened to me when I was early to buying Bitcoin in 2013. First they call you crazy. Then they want to know how you got rich. The answer is never that impressive: “Patience, hard work, ignoring 99.9% of opinions.”\n\n# The path to getting rich online in 2025\n\nIf the start of riches online was access to information, then the future of riches in 2025 and beyond is simply getting people results.\n\nWe’ve moved from offering information to transformations.\n\nIf you are someone that is 10 steps ahead of others in a field/topic, and create an operating system to get results, you have the opportunity to get rich online. What I love is that this trend is still quiet. I haven’t seen anyone talking about it.\n\nThe people I look up to in my space have figured it out… but most haven’t.\n\nI wish I had a s*xier or complicated answer for you. I don’t. This is the big shift in the internet. It comes with a few nuances…\n\n### 1. Sound over the top freaking human, baby!\n\nYou now have to make your humanness undeniable or it’s assumed AI created your content. How?\n\n* Write like you talk\n* Sound authentic instead of smart\n* Don’t use AI to write. Use it to edit, refine, and do research\n* Add your cultural background to everything (I’m Aussie, mate)\n* Make most content story-driven (either yours or someone else's)\n* Throw out all the old rules of the book publishing world\n* Break all grammar and spelling rules\n* Show the highs and the lows\n* Entertain\n* Have fun\n\nWrite like you talk\n\nSound authentic instead of smart\n\nDon’t use AI to write. Use it to edit, refine, and do research\n\nAdd your cultural background to everything (I’m Aussie, mate)\n\nMake most content story-driven (either yours or someone else's)\n\nThrow out all the old rules of the book publishing world\n\nBreak all grammar and spelling rules\n\nShow the highs and the lows\n\nEntertain\n\nHave fun\n\nLet everyone else post generic memes using AI, and copy “templates” that make them sound like monotone robots that haven’t had s*x in 10 years and need to be lubed up.\n\n### 2. Focus on creating experiences\n\nThe $0 critics said physical retail shops would die.\n\nThey were wrong. Retail didn’t die, it transformed. Walk into a modern retail shop and you’ll see it’s experiential.\n\nThere’s a brand. It stands for something. The shop has a certain smell. The decoration makes a statement. There’s a mission. Every element of the shop is deliberate and designed to acquire your loyalty.\n\nThe same is happening online. All the horse sh*t, clickbait garbage is becoming worthless. It’s being ignored. Egos are being destroyed.\n\nMeanwhile, experience designers who understand UX are building interesting products. They’re live. They’re real. They’re entertaining. They’re delivered over weeks, months, or even a year.\n\nSelling information makes people feel dead inside – and when they don’t act on it, they feel even worse.\n\nSelling experiences makes people have an emotional reaction. That’s what we’re all secretly craving and it’s hard-wired into your DNA.\n\n### 3. Create community without being a woo-woo hippy\n\nThe first iteration of online communities was Facebook groups. We quickly grew tired of them. Boring, toxic, and a firehose of content aimed at your genitals.\n\nThe gurus then said commenting was community-building. But AI-generated comments destroyed that clown party. Now the idea of community is evolving.\n\nIt’s because of 2020 covid.\n\nWe became so isolated during that period, and for many of us, that isolation still hasn’t worn off yet. So we secretly crave real community.\n\nWe’re looking to be more social with the right people, even if we don’t admit it.\n\nTo deliver that requires 1) heavy curation 2) forming a group around a goal or mission 3) making the community paid to filter out noise.\n\nThis is why private communities that host in-person dinners and high-end masterminds are seeing enormous growth.\n\nYou don’t hear about that much because the ones who’ve figured it out want to keep their competitive advantage and get rich before the masses learn.\n\n# The simple way riches are earned in 2025\n\nThis is the breakthrough moment. Pay attention.\n\nBefore 2025 gurus would manipulate and brainwash people into trading their existing skills for a new skill, or as they call it, business model.\n\nThis meant people were making money doing things out of alignment with their true nature just to get rich or make passive income that was actually just a p0rn fantasy.\n\nThey also had to nuke most of their skills which put them miles away from mastery. That’s changed too. Thank god.\n\nOrdinary people are now taking their existing skills and monetizing them. Instead of selling those skills to one person or employer, they’re shifting to selling 1-to-many.\n\nThere’s one caveat. Not every skill is a monetizable skill. For example, you might have a skill of editing someone’s writing, but in 2025 that’s no longer a monetizable skill – AI can do it for free.\n\nOr you might have a unique skill of dog walking. But people online won’t pay you thousands for this skill. The difference to understand is a monetizable skill has a tangible ROI. And that ROI ties back to one of the fundamental human desires.\n\n* Health\n* Wealth\n* Business\n* Productivity\n* Relationships\n* Self-improvement\n\nHealth\n\nWealth\n\nBusiness\n\nProductivity\n\nRelationships\n\nSelf-improvement\n\nWithout a tangible ROI and a connection to a basic human desire, you won’t get rich online in 2025.\n\nToo many people still don’t get this. They’re trying to sell nice-to-haves.\n\n# Whatever you build it must harness this\n\nThere’s another quiet factor that determines whether you get rich. If you make lots of money and have no time, you’re not rich.\n\nThat means you must find a way to make your product or service AI-powered. AI does some of the work for you which frees up your time to do things people will love and pay money for.\n\nIgnoring AI is a death wish.\n\nWhat I did was approach the problem from a different angle. Instead of trying to do all the heavy lifting and figuring out all the complexities of AI, I decided to partner with someone who’s already figured out AI. Likely, this is good option for you as well.\n\nIn 2025…\n\nNo AI = Sh*t Product\n\n# Closing Thought\n\nThe way to get rich online has changed drastically.\n\nAnd many people are still stuck in the old world of websites, spreadsheets, books, followers, and personal brands disguised as huge egos.\n\nThe game has changed. You can either adapt or die. If you pivot while it’s still early you’ll do better than most.\n\nEmployment is changing too.\n\nHaving thousands of employees on the books earning a fixed salary is becoming obsolete. More companies will hire one-person businesses to cap downside, get fixed outcomes, and have people come in and out as needed.\n\nAll these changes mean if you’re lazy, complacent or have no agency, you’ll see your bank balance dwindle. It’s time to pay attention and leverage the new economy.\n\nWhich of these shifts surprised you most? I’d love to hear how you’re adapting — drop your story in the comments.\n\n---\n\nI send this email weekly. If you would also like to receive it, join the 148,000+ other smart people who absolutely love it today.\n\n👉 If you enjoy reading this post, feel free to share it with friends! Or feel free to click the ❤️ button on this post so more people can discover it on Substack 🙏\n\nShare"
    }
  ],
  "main_content": "# How Ordinary People Get Rich on the Internet in 2025\n\n### The game has changed\n\nShare\n\nEveryone wants to get rich on the internet.\n\nIt’s replaced the previous American Dream of climbing the corporate ladder to earn enough money to buy a house with a white picket fence and an SUV.\n\nOne of the most popular careers now is simply “Youtuber.” On the surface, it looks like a boring game to get famous. When you look beneath, like I have, you realize the driver of these new careers is something else.\n\nPeople want meaning.People want ownership.People want to make their side hustle their main gig.\n\nThis never used to be possible before the internet. Why? Because you needed distribution to take a passion for BBQing steaks and turn it into a full-time income. That meant impressing gatekeepers and doing a lot of underpaid or even free work.\n\nFacebook, Instagram, TikTok, and Youtube changed all of that. The built-in distribution means you can take any idea and reach enough people to own a one-person (or bigger) business.\n\n# Getting rich online has radically changed (and 90% of people have no clue)\n\nThe internet has now hard forked into a new era.\n\nBecause most people don’t know, they’re still chasing old ways of making money online which mostly don’t work anymore. I’ve been doing this for 11 years every day. Let me explain the difference between before and now.\n\n### 1. The naughty secret creators don’t want you to know\n\nMany of the people you look up to online faked their audience growth.\n\nWait, what? Yep. Most of them won't admit it. How did they do it?\n\n* Buying followers\n* Paying people to like/comment on their content\n* Engagement pods\n\nBuying followers\n\nPaying people to like/comment on their content\n\nEngagement pods\n\nEvery time I confront any creator behind the scenes they deny this. Yet it’s easy for me to spot because I can see who is engaging with their content and I know which accounts are selling commenting as a service.\n\nI don’t fundamentally think this practice is bad.\n\nIt’s not that much different than buying ads. What blows people’s minds is I haven’t engaged in this myself. I came from an earlier iteration of the internet, where if you wrote good headlines with helpful content, that was enough.\n\nI’d have way more followers if I bought engagement. I’m so glad I didn’t. Fame is a nightmare, and having millions of followers would have likely turned me into some sort of Tim Ferriss video game character.\n\nIn 2025, buying engagement is far less effective.\n\nThe social media algorithms have gotten smarter. They can filter out engagement buyers and even ban them. And “for you” feeds mean that ideas go viral no matter a person’s audience size.\n\n### 2. The era of “info products” is dead\n\nA few years ago you could sell a book or a course and become a millionaire.\n\nThat’s exactly what happened to me. Specific information used to be unique and highly desirable. Men would throw their G-strings on your social media stage to get access to your “growth guide.\"\n\nThe game got old.\n\nWhy? People no longer need more information. They’ve realized they need more action. The other significant change is the sheer amount of information online. Since the introduction of AI in 2022 the internet is being clogged up with content sludge generated by lazy “content creators.”\n\nWe now have the opposite problem: too much information.\n\nWe’re drowning in information.\n\nThe solution has been curation of information, and that’s why paid newsletters created a generational shift. We’d now rather pay for a newsletter than consume hours of free surface-level content that puts us to sleep or is full of infomercials.\n\nWhat’s bizarre is the message that info products are dead hasn’t become mainstream. Delusional people still think the mass market is going to buy their $20 ebook by the millions.\n\nI can only see info products are dead because 1) I run a info product side business 2) my closest friends run info product businesses and have seen 50%+ drops in sales.\n\n### 3. Followers mean nothing\n\nIt used to be cool to have 100k followers. Now it’s meaningless.\n\nSomeone can click the follow button once on your profile, then never see your content again. Followers aren’t special. And people that focused on followers are now realizing they’re useless when they come to monetize.\n\nWe’ve all heard stories of the guy who has 1M followers and can’t sell 5 t-shirts.\n\nOwned audiences are now all that matters. That means having an email list. But even that is shifting. The next level beyond an email list is a paid member-only community.\n\nBeing fixated on followers is preventing a lot of people from getting rich in the AI era of the internet.\n\n# Why get rich online\n\nGetting rich online sounds like an incredibly shallow goal.\n\nThe reason ordinary people are doing it has nothing to do with money or Lambos. It has to do with freedom.\n\nIt’s why all the flexing of luxury on Instagram is becoming boring and people are losing interest.\n\nWhen you think of getting rich online you might think of someone like Dan Koe. While he’s cool and making incredible amounts of money, the people I’m talking about in this essay are different.\n\nThey don’t have huge audiences. You likely have never heard of any of them. They’re ordinary people with no special talent. They’re social proof is minimal.\n\nHow did I meet these people? 1) Through my online business 2) by being a guest teacher in other creators’ masterminds.\n\nI didn’t intend this to happen. It just did. Before this shift occurred I was mainly interacting with 1M+ follower creators, but not anymore.\n\nWhy do these ordinary people get rich online? They’re early. They’ve accidentally become part of the future. When you’re early to a trend as big as this, you get unfair and outsized rewards.\n\nThe same happened to me when I was early to buying Bitcoin in 2013. First they call you crazy. Then they want to know how you got rich. The answer is never that impressive: “Patience, hard work, ignoring 99.9% of opinions.”\n\n# The path to getting rich online in 2025\n\nIf the start of riches online was access to information, then the future of riches in 2025 and beyond is simply getting people results.\n\nWe’ve moved from offering information to transformations.\n\nIf you are someone that is 10 steps ahead of others in a field/topic, and create an operating system to get results, you have the opportunity to get rich online. What I love is that this trend is still quiet. I haven’t seen anyone talking about it.\n\nThe people I look up to in my space have figured it out… but most haven’t.\n\nI wish I had a s*xier or complicated answer for you. I don’t. This is the big shift in the internet. It comes with a few nuances…\n\n### 1. Sound over the top freaking human, baby!\n\nYou now have to make your humanness undeniable or it’s assumed AI created your content. How?\n\n* Write like you talk\n* Sound authentic instead of smart\n* Don’t use AI to write. Use it to edit, refine, and do research\n* Add your cultural background to everything (I’m Aussie, mate)\n* Make most content story-driven (either yours or someone else's)\n* Throw out all the old rules of the book publishing world\n* Break all grammar and spelling rules\n* Show the highs and the lows\n* Entertain\n* Have fun\n\nWrite like you talk\n\nSound authentic instead of smart\n\nDon’t use AI to write. Use it to edit, refine, and do research\n\nAdd your cultural background to everything (I’m Aussie, mate)\n\nMake most content story-driven (either yours or someone else's)\n\nThrow out all the old rules of the book publishing world\n\nBreak all grammar and spelling rules\n\nShow the highs and the lows\n\nEntertain\n\nHave fun\n\nLet everyone else post generic memes using AI, and copy “templates” that make them sound like monotone robots that haven’t had s*x in 10 years and need to be lubed up.\n\n### 2. Focus on creating experiences\n\nThe $0 critics said physical retail shops would die.\n\nThey were wrong. Retail didn’t die, it transformed. Walk into a modern retail shop and you’ll see it’s experiential.\n\nThere’s a brand. It stands for something. The shop has a certain smell. The decoration makes a statement. There’s a mission. Every element of the shop is deliberate and designed to acquire your loyalty.\n\nThe same is happening online. All the horse sh*t, clickbait garbage is becoming worthless. It’s being ignored. Egos are being destroyed.\n\nMeanwhile, experience designers who understand UX are building interesting products. They’re live. They’re real. They’re entertaining. They’re delivered over weeks, months, or even a year.\n\nSelling information makes people feel dead inside – and when they don’t act on it, they feel even worse.\n\nSelling experiences makes people have an emotional reaction. That’s what we’re all secretly craving and it’s hard-wired into your DNA.\n\n### 3. Create community without being a woo-woo hippy\n\nThe first iteration of online communities was Facebook groups. We quickly grew tired of them. Boring, toxic, and a firehose of content aimed at your genitals.\n\nThe gurus then said commenting was community-building. But AI-generated comments destroyed that clown party. Now the idea of community is evolving.\n\nIt’s because of 2020 covid.\n\nWe became so isolated during that period, and for many of us, that isolation still hasn’t worn off yet. So we secretly crave real community.\n\nWe’re looking to be more social with the right people, even if we don’t admit it.\n\nTo deliver that requires 1) heavy curation 2) forming a group around a goal or mission 3) making the community paid to filter out noise.\n\nThis is why private communities that host in-person dinners and high-end masterminds are seeing enormous growth.\n\nYou don’t hear about that much because the ones who’ve figured it out want to keep their competitive advantage and get rich before the masses learn.\n\n# The simple way riches are earned in 2025\n\nThis is the breakthrough moment. Pay attention.\n\nBefore 2025 gurus would manipulate and brainwash people into trading their existing skills for a new skill, or as they call it, business model.\n\nThis meant people were making money doing things out of alignment with their true nature just to get rich or make passive income that was actually just a p0rn fantasy.\n\nThey also had to nuke most of their skills which put them miles away from mastery. That’s changed too. Thank god.\n\nOrdinary people are now taking their existing skills and monetizing them. Instead of selling those skills to one person or employer, they’re shifting to selling 1-to-many.\n\nThere’s one caveat. Not every skill is a monetizable skill. For example, you might have a skill of editing someone’s writing, but in 2025 that’s no longer a monetizable skill – AI can do it for free.\n\nOr you might have a unique skill of dog walking. But people online won’t pay you thousands for this skill. The difference to understand is a monetizable skill has a tangible ROI. And that ROI ties back to one of the fundamental human desires.\n\n* Health\n* Wealth\n* Business\n* Productivity\n* Relationships\n* Self-improvement\n\nHealth\n\nWealth\n\nBusiness\n\nProductivity\n\nRelationships\n\nSelf-improvement\n\nWithout a tangible ROI and a connection to a basic human desire, you won’t get rich online in 2025.\n\nToo many people still don’t get this. They’re trying to sell nice-to-haves.\n\n# Whatever you build it must harness this\n\nThere’s another quiet factor that determines whether you get rich. If you make lots of money and have no time, you’re not rich.\n\nThat means you must find a way to make your product or service AI-powered. AI does some of the work for you which frees up your time to do things people will love and pay money for.\n\nIgnoring AI is a death wish.\n\nWhat I did was approach the problem from a different angle. Instead of trying to do all the heavy lifting and figuring out all the complexities of AI, I decided to partner with someone who’s already figured out AI. Likely, this is good option for you as well.\n\nIn 2025…\n\nNo AI = Sh*t Product\n\n# Closing Thought\n\nThe way to get rich online has changed drastically.\n\nAnd many people are still stuck in the old world of websites, spreadsheets, books, followers, and personal brands disguised as huge egos.\n\nThe game has changed. You can either adapt or die. If you pivot while it’s still early you’ll do better than most.\n\nEmployment is changing too.\n\nHaving thousands of employees on the books earning a fixed salary is becoming obsolete. More companies will hire one-person businesses to cap downside, get fixed outcomes, and have people come in and out as needed.\n\nAll these changes mean if you’re lazy, complacent or have no agency, you’ll see your bank balance dwindle. It’s time to pay attention and leverage the new economy.\n\nWhich of these shifts surprised you most? I’d love to hear how you’re adapting — drop your story in the comments.\n\n---\n\nI send this email weekly. If you would also like to receive it, join the 148,000+ other smart people who absolutely love it today.\n\n👉 If you enjoy reading this post, feel free to share it with friends! Or feel free to click the ❤️ button on this post so more people can discover it on Substack 🙏\n\nShare",
  "word_count": 2266,
  "reading_time_minutes": 11
}