{
  "id": "im-39-and-just-realized-ive-been-lied-to-about-how-money-works",
  "source": "tim_denning",
  "title": "I'm 39 and Just Realized I've Been Lied to About How Money Works",
  "author": "Tim Denning",
  "date": null,
  "source_url": "https://timdenning.substack.com/p/im-39-and-just-realized-ive-been",
  "topics": [
    "Just",
    "Realized",
    "Lied",
    "About",
    "Money"
  ],
  "sections": [
    {
      "heading": "Main",
      "content": "# I'm 39 and Just Realized I've Been Lied to About How Money Works\n\n### Everything you’ve been taught about earning, saving, and investing is backwards — and most people will never figure it out.\n\nShare\n\nThe education system pretends to set us up for life.\n\nYou choose one career. You go into debt for a college degree. You work hard. You earn a salary. You save money. You get into debt and buy a house. Have kids. Retire at 65. Then enjoy all the money you made at the job.\n\nI got sold on this dream too. It left me dead broke.\n\nThese societal norms set you up to completely misunderstand money. It’s hard to escape because everyone around you has been brainwashed by this idea of how money works. I spent years reading every finance book in history, studying recessions, and working in a bank for 10 years.\n\nI figured out how money works by understanding what wealthy people do. Here’s the brutal truth about money that you won’t see anywhere else.\n\n# The disgusting lie hidden from plain sight\n\nThe traditional path teaches us to acquire one skill and specialize.\n\nThis severely limits our options. So we choose one career to deploy that one skill because that’s what the system taught us. We end up with one income stream in the form of a salary.\n\nIt gets more bizarre.\n\nOnce you have an income you can borrow money to buy a house. To get the loan you show the bank you currently have an income and they calculate how much they can lend you. What’s strange is this calculation doesn’t take into account the fact you could lose your salary tomorrow.\n\nIt just assumes the job is always there (first red flag).\n\nEvery time the bank gives out a loan to someone the myth is that they’re using depositors money to lend it to you. Thanks to what’s known as fractional reserve banking, that’s not true.\n\nOnly a small part of what they lend you is money the bank has on hand. The rest of the money is created out of thin air. Some call this money printing.\n\nLet’s go deeper down the rabbit hole.\n\nAll the money you earn in life is paid to you using a government-issued currency. This currency is the lifeblood of everything you do. It lets you buy food, get shelter, and put your kids through school.\n\nYet no one ever questions what this currency is.\n\nRarely do people go back through history and look at the disadvantages of these government-issued currencies. It’s odd when you think about it because people work their entire lives to get this currency.\n\nNow we get to racism.\n\nIn life, you’re dealt a set of cards when you’re born. One of those cards is, what currency will you have access to.\n\nIf you’re born in America, you have access to the strongest currency in the world. If you’re born in, say, Argentina, you have a huge disadvantage. The currency you get paid in has an annual inflation rate of 237%. But the word inflation is confusing.\n\nInflation doesn’t mean prices going up. Nope. Inflation means the rate at which the currency you hold devalues each year. That is experienced as higher prices, but the reality of it is, it’s just your purchasing power going down.\n\nSo in Argentina prices go up 237% each year and the citizens’ purchasing power goes down by 237% each year. That’s a huge disadvantage.\n\nEven if you’re a genius on a 6-figure salary, you’re fighting a huge financial burden.\n\nMaybe you don’t live in a country that has a bad currency or stupidly high inflation. You say “Timbo, I live in Australia. Our currency is stable and inflation is 3%.”\n\nThe lie continues.\n\nSo you’re okay with losing 3% of everything you earn every year? I doubt it. It gets darker. The inflation rate in every country is measured by the government. Unfortunately, they have a vested interest not to tell you how high inflation really is.\n\nSo they don’t. They lie.\n\nThey mess with the inflation calculation rate to make it sound like prices aren’t getting as high every year as they really are.\n\nThe average person doesn’t know that. So they think everything is fine. But it’s not fine because the cost of living is skyrocketing, right?\n\nExcept the cost of living crisis is a deception. A false enemy.\n\nIt’s a way for governments to misdirect what’s happening. Businesses aren’t magically raising their prices sky high because they’re evil bastards. No. Prices are going sky high because the currency of every major country is melting like an ice cube.\n\nNow we get to the good bit.\n\nWealthy people are aware of everything I just said. They do the opposite of society. They don’t hold much currency. They know it’s monopoly money trash that can be created out of thin air.\n\nSo they buy hard assets. It’s why you’re hearing about how gold and Bitcoin are rapidly going up in price. It’s also why tech stocks are exploding. Wealthy people don’t want to hold too much currency because it’s being devalued.\n\nThe next question is why.\n\n# The bigger picture that’s easy to misunderstand\n\nNone of this is a conspiracy theory. Governments, banks, and central banks aren’t trying to f*ck us. They have no choice.\n\nBillionaire Warren Buffett said the quiet part out loud a few years ago: “The debt is never getting repaid.”\n\nThis tiny statement changed the course of history. But only wealthy people at his annual event heard him say it. The media didn’t report on it.\n\nHere’s what it means:\n\nGovernments are never going to pay back their debt.\n\nIt must be this way. The debt is too large. The incentive of anyone running any government is to get re-elected every time there is an election. To do that you have to give citizens free money, build stuff, and make a lot of promises.\n\nThese short-term incentives create massive spending. Tax revenue in major countries can’t keep up with spending. So citizens all over the world pay a hidden tax known to wealthy people as currency debasement, or to the masses, as inflation.\n\nWhen the government needs more money, it can get the central bank to create it out of thin air. They don’t need your tax dollars. They devalue the money you earn without you knowing it to fund their excessive spending.\n\nIt goes deeper.\n\nWealthy people are aware of that too. But they’re not aware that central banks, like the Federal Reserve, mainly did the dirty work. Until recently. Now the treasury department of major governments has mechanisms to also devalue currencies.\n\nThis game of messing with the currency people trade the hours of their life for is happening in every country. It’s a deadly virus. And history shows it won’t stop.\n\nIt gets whackier.\n\nAs the currency gets devalued, prices go up. So does the value of your home and your investments like stocks. When people’s investment portfolios go up they get excited.\n\nThey feel richer.\n\nBut a lot of the growth and price appreciation with those investments isn’t real. It’s currency debasement. It’s the currency manipulation causing it.\n\nYou may not care.\n\nBut when your investments go up in value you must pay capital gains tax when you sell them. So the government doesn’t just get you by reducing your purchasing power on the front end. They get you on the back end, too, with capital gains tax.\n\nThis entire process also leads home values to go up. Given this is the largest asset most people own, and it’s crucial to retirement, it gives people a false sense of safety.\n\n> “I bought my home in 2005 for $200,000 and now it’s worth $500,000.”\n\n“I bought my home in 2005 for $200,000 and now it’s worth $500,000.”\n\nA normal person would see that as a huge gain. A wealthy person would think to themselves, “Did my home go up in value or did the currency I’m measuring my home in get weaker?”\n\nCan you now start to see the illusion?\n\nPeople work their entire lives to earn this precious government-issued currency without understanding what it really is. You could even call this modern slavery. It’s so sophisticated most people will never work it out.\n\nAnd unless you understand how money works, you’ll be enslaved by it.\n\nNo matter how hard you work, how good your skills are, or how smart you are with investing… you cannot outrun this systematic flaw of human society.\n\n# The flow on effects nobody is paying attention to\n\nWe’re living in two separate realities.\n\nOne reality is the country you live in with its individual currency, laws, local jobs, and way of life. The other reality is the internet. It has no borders, it has different currencies, and work doesn’t have to be provided by a corporation.\n\nThese two realities are merging. And most people haven’t figured it out.\n\nThe limitations of location are disappearing. Work is moving from fixed corporations in single countries with fixed salaries and working hours, to one-person businesses.\n\nThis is why we’re seeing mass layoffs again right now. It’s a sign the old world of countries and large corporations is breaking. Countries and corporations move too slowly. The incentives of the old world make no sense for the people or the institution.\n\nAs more people opt out of the old world, things will keep breaking. What’s really happening at a philosophical level is humanity is quietly rearranging its resources.\n\nThe way people, time, value and even money is divided up is fracturing.\n\nIn the meantime, governments will need to continue to mess with their currencies. Debt will continue to spiral out of control and never get paid back. Taxes will eventually need to rise to cover all the mess, wastage, and inefficiency. Eventually humanity will auto-correct itself, likely through war.\n\nThis isn’t a reality to be afraid of. It’s a huge opportunity. But it starts with understanding why the old world is breaking, and why most people’s understanding of how money works is broken.\n\n# What I’m doing\n\nI am not a billionaire.\n\nAnd I don’t know everything there is to know about finance. I’m nowhere near as talented as some of the finance accounts on social media. I’m writing about this at 39 because I’m dealing with it right now.\n\nThe country I live in, Australia, has the second-highest house prices in the world. I earn good money but still went through a nightmare situation to buy a home. I pay almost 50% of my income in tax, and another 10% GST tax every time I buy anything.\n\nI’ve been forced to figure out how money works. If I stayed in banking on a fixed salary, I would not be able to afford to have a family. And every year my net worth in real terms would have gone down.\n\nSo I’m never going back to a salary.\n\nI’m focusing on running a small business and mastering the digital economy which includes AI. Every day I learn more about how money works (or doesn’t work), so I can prepare myself for the transition between the old world and the new one.\n\nI geek out on the bond market. I read thoughts from “The Profit.” I study Raoul Pal’s “Everything Code.” I learn about the coming singularity technology is creating. Mostly, I stay curious. I don’t fear change. I try to embrace it. I assume I know nothing and have the financial education of a 5th grader.\n\n# What this really means for you\n\nUnderstanding the lie of how money works – that’s been planted in your mind by the education system – is the first step.\n\nThe next part is to rethink how you view work. That’ll likely lead you to acquire new skills and start thinking like a business owner (even if you’re not one). Then you’ll probably think about where your money goes.\n\nThe old world dream is to make money from a salary and buy real estate that you rent out. In most parts of the world this is now unprofitable, but only if you understand what I wrote above. Plus, it forces you to stay in a fixed location and be susceptible to rising taxes. Not to mention, the huge debt you must take out to buy real estate causes enormous stress and limits your options.\n\nLikely, you’ll need to look at alternative investments. This is a rapidly evolving area so I won’t waste time making suggestions. Just know that the time you give away to earn currency has to be stored, and storing your time in currency is stealing your time.\n\nThe final part is retirement. The whole myth of retirement is you do work you don’t give a f*ck about to save money you can spend in retirement. But if the whole system we use to store our money is broken, then the financial prosperity we think we’re going to experience at 65 isn’t real.\n\nHarsh Truth: Most people will never retire.\n\nThere’s a good and a bad side. For people like me, I never want to retire because I love what I do. For employees who hate their jobs, the magical retirement day isn’t going to come which will likely make them depressed.\n\nThere’s also the chance that the pension funds that hold our retirement money will go bankrupt because of everything I just explained. It’s one reason I took my retirement money out of the pension system.\n\nIt’s time for all of us to take responsibility and learn how money works. Otherwise, the hours of our lives will be quietly stolen from us.\n\nThe deeper you get into the digital world, the more likely you are to escape the financial ramifications of the old world.\n\nChoose wisely.\n\nIf the rules of wealth keep changing faster than we can adapt, what does it mean to be truly rich?\n\n---\n\nP.S. Are you ready for Black Friday?\n\nI don’t mean ready to buy...\n\nI mean are you ready to take full advantage of the year’s biggest sales month?\n\nDon’t create a whole new offer.\n\nDon’t offer a big huge discount.\n\nI’ll show you what to do instead"
    }
  ],
  "main_content": "# I'm 39 and Just Realized I've Been Lied to About How Money Works\n\n### Everything you’ve been taught about earning, saving, and investing is backwards — and most people will never figure it out.\n\nShare\n\nThe education system pretends to set us up for life.\n\nYou choose one career. You go into debt for a college degree. You work hard. You earn a salary. You save money. You get into debt and buy a house. Have kids. Retire at 65. Then enjoy all the money you made at the job.\n\nI got sold on this dream too. It left me dead broke.\n\nThese societal norms set you up to completely misunderstand money. It’s hard to escape because everyone around you has been brainwashed by this idea of how money works. I spent years reading every finance book in history, studying recessions, and working in a bank for 10 years.\n\nI figured out how money works by understanding what wealthy people do. Here’s the brutal truth about money that you won’t see anywhere else.\n\n# The disgusting lie hidden from plain sight\n\nThe traditional path teaches us to acquire one skill and specialize.\n\nThis severely limits our options. So we choose one career to deploy that one skill because that’s what the system taught us. We end up with one income stream in the form of a salary.\n\nIt gets more bizarre.\n\nOnce you have an income you can borrow money to buy a house. To get the loan you show the bank you currently have an income and they calculate how much they can lend you. What’s strange is this calculation doesn’t take into account the fact you could lose your salary tomorrow.\n\nIt just assumes the job is always there (first red flag).\n\nEvery time the bank gives out a loan to someone the myth is that they’re using depositors money to lend it to you. Thanks to what’s known as fractional reserve banking, that’s not true.\n\nOnly a small part of what they lend you is money the bank has on hand. The rest of the money is created out of thin air. Some call this money printing.\n\nLet’s go deeper down the rabbit hole.\n\nAll the money you earn in life is paid to you using a government-issued currency. This currency is the lifeblood of everything you do. It lets you buy food, get shelter, and put your kids through school.\n\nYet no one ever questions what this currency is.\n\nRarely do people go back through history and look at the disadvantages of these government-issued currencies. It’s odd when you think about it because people work their entire lives to get this currency.\n\nNow we get to racism.\n\nIn life, you’re dealt a set of cards when you’re born. One of those cards is, what currency will you have access to.\n\nIf you’re born in America, you have access to the strongest currency in the world. If you’re born in, say, Argentina, you have a huge disadvantage. The currency you get paid in has an annual inflation rate of 237%. But the word inflation is confusing.\n\nInflation doesn’t mean prices going up. Nope. Inflation means the rate at which the currency you hold devalues each year. That is experienced as higher prices, but the reality of it is, it’s just your purchasing power going down.\n\nSo in Argentina prices go up 237% each year and the citizens’ purchasing power goes down by 237% each year. That’s a huge disadvantage.\n\nEven if you’re a genius on a 6-figure salary, you’re fighting a huge financial burden.\n\nMaybe you don’t live in a country that has a bad currency or stupidly high inflation. You say “Timbo, I live in Australia. Our currency is stable and inflation is 3%.”\n\nThe lie continues.\n\nSo you’re okay with losing 3% of everything you earn every year? I doubt it. It gets darker. The inflation rate in every country is measured by the government. Unfortunately, they have a vested interest not to tell you how high inflation really is.\n\nSo they don’t. They lie.\n\nThey mess with the inflation calculation rate to make it sound like prices aren’t getting as high every year as they really are.\n\nThe average person doesn’t know that. So they think everything is fine. But it’s not fine because the cost of living is skyrocketing, right?\n\nExcept the cost of living crisis is a deception. A false enemy.\n\nIt’s a way for governments to misdirect what’s happening. Businesses aren’t magically raising their prices sky high because they’re evil bastards. No. Prices are going sky high because the currency of every major country is melting like an ice cube.\n\nNow we get to the good bit.\n\nWealthy people are aware of everything I just said. They do the opposite of society. They don’t hold much currency. They know it’s monopoly money trash that can be created out of thin air.\n\nSo they buy hard assets. It’s why you’re hearing about how gold and Bitcoin are rapidly going up in price. It’s also why tech stocks are exploding. Wealthy people don’t want to hold too much currency because it’s being devalued.\n\nThe next question is why.\n\n# The bigger picture that’s easy to misunderstand\n\nNone of this is a conspiracy theory. Governments, banks, and central banks aren’t trying to f*ck us. They have no choice.\n\nBillionaire Warren Buffett said the quiet part out loud a few years ago: “The debt is never getting repaid.”\n\nThis tiny statement changed the course of history. But only wealthy people at his annual event heard him say it. The media didn’t report on it.\n\nHere’s what it means:\n\nGovernments are never going to pay back their debt.\n\nIt must be this way. The debt is too large. The incentive of anyone running any government is to get re-elected every time there is an election. To do that you have to give citizens free money, build stuff, and make a lot of promises.\n\nThese short-term incentives create massive spending. Tax revenue in major countries can’t keep up with spending. So citizens all over the world pay a hidden tax known to wealthy people as currency debasement, or to the masses, as inflation.\n\nWhen the government needs more money, it can get the central bank to create it out of thin air. They don’t need your tax dollars. They devalue the money you earn without you knowing it to fund their excessive spending.\n\nIt goes deeper.\n\nWealthy people are aware of that too. But they’re not aware that central banks, like the Federal Reserve, mainly did the dirty work. Until recently. Now the treasury department of major governments has mechanisms to also devalue currencies.\n\nThis game of messing with the currency people trade the hours of their life for is happening in every country. It’s a deadly virus. And history shows it won’t stop.\n\nIt gets whackier.\n\nAs the currency gets devalued, prices go up. So does the value of your home and your investments like stocks. When people’s investment portfolios go up they get excited.\n\nThey feel richer.\n\nBut a lot of the growth and price appreciation with those investments isn’t real. It’s currency debasement. It’s the currency manipulation causing it.\n\nYou may not care.\n\nBut when your investments go up in value you must pay capital gains tax when you sell them. So the government doesn’t just get you by reducing your purchasing power on the front end. They get you on the back end, too, with capital gains tax.\n\nThis entire process also leads home values to go up. Given this is the largest asset most people own, and it’s crucial to retirement, it gives people a false sense of safety.\n\n> “I bought my home in 2005 for $200,000 and now it’s worth $500,000.”\n\n“I bought my home in 2005 for $200,000 and now it’s worth $500,000.”\n\nA normal person would see that as a huge gain. A wealthy person would think to themselves, “Did my home go up in value or did the currency I’m measuring my home in get weaker?”\n\nCan you now start to see the illusion?\n\nPeople work their entire lives to earn this precious government-issued currency without understanding what it really is. You could even call this modern slavery. It’s so sophisticated most people will never work it out.\n\nAnd unless you understand how money works, you’ll be enslaved by it.\n\nNo matter how hard you work, how good your skills are, or how smart you are with investing… you cannot outrun this systematic flaw of human society.\n\n# The flow on effects nobody is paying attention to\n\nWe’re living in two separate realities.\n\nOne reality is the country you live in with its individual currency, laws, local jobs, and way of life. The other reality is the internet. It has no borders, it has different currencies, and work doesn’t have to be provided by a corporation.\n\nThese two realities are merging. And most people haven’t figured it out.\n\nThe limitations of location are disappearing. Work is moving from fixed corporations in single countries with fixed salaries and working hours, to one-person businesses.\n\nThis is why we’re seeing mass layoffs again right now. It’s a sign the old world of countries and large corporations is breaking. Countries and corporations move too slowly. The incentives of the old world make no sense for the people or the institution.\n\nAs more people opt out of the old world, things will keep breaking. What’s really happening at a philosophical level is humanity is quietly rearranging its resources.\n\nThe way people, time, value and even money is divided up is fracturing.\n\nIn the meantime, governments will need to continue to mess with their currencies. Debt will continue to spiral out of control and never get paid back. Taxes will eventually need to rise to cover all the mess, wastage, and inefficiency. Eventually humanity will auto-correct itself, likely through war.\n\nThis isn’t a reality to be afraid of. It’s a huge opportunity. But it starts with understanding why the old world is breaking, and why most people’s understanding of how money works is broken.\n\n# What I’m doing\n\nI am not a billionaire.\n\nAnd I don’t know everything there is to know about finance. I’m nowhere near as talented as some of the finance accounts on social media. I’m writing about this at 39 because I’m dealing with it right now.\n\nThe country I live in, Australia, has the second-highest house prices in the world. I earn good money but still went through a nightmare situation to buy a home. I pay almost 50% of my income in tax, and another 10% GST tax every time I buy anything.\n\nI’ve been forced to figure out how money works. If I stayed in banking on a fixed salary, I would not be able to afford to have a family. And every year my net worth in real terms would have gone down.\n\nSo I’m never going back to a salary.\n\nI’m focusing on running a small business and mastering the digital economy which includes AI. Every day I learn more about how money works (or doesn’t work), so I can prepare myself for the transition between the old world and the new one.\n\nI geek out on the bond market. I read thoughts from “The Profit.” I study Raoul Pal’s “Everything Code.” I learn about the coming singularity technology is creating. Mostly, I stay curious. I don’t fear change. I try to embrace it. I assume I know nothing and have the financial education of a 5th grader.\n\n# What this really means for you\n\nUnderstanding the lie of how money works – that’s been planted in your mind by the education system – is the first step.\n\nThe next part is to rethink how you view work. That’ll likely lead you to acquire new skills and start thinking like a business owner (even if you’re not one). Then you’ll probably think about where your money goes.\n\nThe old world dream is to make money from a salary and buy real estate that you rent out. In most parts of the world this is now unprofitable, but only if you understand what I wrote above. Plus, it forces you to stay in a fixed location and be susceptible to rising taxes. Not to mention, the huge debt you must take out to buy real estate causes enormous stress and limits your options.\n\nLikely, you’ll need to look at alternative investments. This is a rapidly evolving area so I won’t waste time making suggestions. Just know that the time you give away to earn currency has to be stored, and storing your time in currency is stealing your time.\n\nThe final part is retirement. The whole myth of retirement is you do work you don’t give a f*ck about to save money you can spend in retirement. But if the whole system we use to store our money is broken, then the financial prosperity we think we’re going to experience at 65 isn’t real.\n\nHarsh Truth: Most people will never retire.\n\nThere’s a good and a bad side. For people like me, I never want to retire because I love what I do. For employees who hate their jobs, the magical retirement day isn’t going to come which will likely make them depressed.\n\nThere’s also the chance that the pension funds that hold our retirement money will go bankrupt because of everything I just explained. It’s one reason I took my retirement money out of the pension system.\n\nIt’s time for all of us to take responsibility and learn how money works. Otherwise, the hours of our lives will be quietly stolen from us.\n\nThe deeper you get into the digital world, the more likely you are to escape the financial ramifications of the old world.\n\nChoose wisely.\n\nIf the rules of wealth keep changing faster than we can adapt, what does it mean to be truly rich?\n\n---\n\nP.S. Are you ready for Black Friday?\n\nI don’t mean ready to buy...\n\nI mean are you ready to take full advantage of the year’s biggest sales month?\n\nDon’t create a whole new offer.\n\nDon’t offer a big huge discount.\n\nI’ll show you what to do instead",
  "word_count": 2382,
  "reading_time_minutes": 12
}