{
  "id": "the-biggest-wealth-transfer-in-history-is-happening-right-now",
  "source": "tim_denning",
  "title": "The Biggest Wealth Transfer in History Is Happening Right Now",
  "author": "Tim Denning",
  "date": null,
  "source_url": "https://timdenning.substack.com/p/the-biggest-wealth-transfer-in-history",
  "topics": [
    "Biggest",
    "Wealth",
    "Transfer",
    "History",
    "Happening"
  ],
  "sections": [
    {
      "heading": "Main",
      "content": "# The Biggest Wealth Transfer in History Is Happening Right Now\n\n### You can be a part of it if you choose.\n\nShare\n\nTrillions of dollars are flowing right now.\n\nMost people are missing it. They’re asleep at the wheel of their life heading off a cliff. They’re using the country where they live as an excuse, despite them being connected to the internet.\n\nBig idea: The internet removed country borders.\n\nWhere you come from is irrelevant. Who your parents were or what college education you have is as meaningless as the fact I’m wearing bright red underpants right now with pink stains on them.\n\nThe wealth transfer going on is wild.\n\nI’m right in the middle of it. I feel like Gandalf from the Lord of the Rings movie with the ability to see the future and navigate people through it.\n\nThere’s a lot of hype. The noise is deafening. At the core of it is the truth which is hard to see. Some people still don’t understand the foundation of the global economy.\n\nThey keep saying “there’s so much debt” without understanding the debt will never be paid back. They wonder why the money they earn each year buys less and less and they can’t figure out why.\n\nLet me decode for you the biggest wealth transfer in history (bigger than the baby boomer boom) into 6 parts.\n\n# Part 1 – Programmed minds versus the free mind\n\nFor as long as we’ve had TVs, newspapers, and radio we’ve been subconsciously programmed by the mass media.\n\nThe cracks appeared when we started to learn how Hollywood used tricks to make movies. Or when they edited true stories to make them something they weren’t to increase the marketability of the movie.\n\n> Bottom line: mainstream media will fake anything for the right reason.\n\nBottom line: mainstream media will fake anything for the right reason.\n\nBefore the internet’s supremacy most of us had a programmed mind. Then social media rose to dominance and gave us the chance to opt out and program our minds the way we saw fit.\n\nThis has given a segment of society a massive advantage. By freeing their minds they’ve been able to create results that seem impossible.\n\nBut most minds still aren’t free. I’ll give you an example. If you ask the average person about Elon Musk, many will say they hate him. My uncle is one of those people.\n\nHe wants to murder Elon.\n\nSo I asked my uncle why he didn’t like Elon.\n\n“He’s evil. He’s a dangerous man. He’s Hitler.”\n\nThen I say “Have you ever had dinner with Elon?”\n\nNo.\n\n“Have you ever met Elon?”\n\nNo.\n\n“Do you know anyone who knows Elon?”\n\nNo.\n\n“So how do you know these things about Elon, uncle?”\n\nThe answer is the media told him these things. They programmed his mind. The mainstream media does this because they’re driven by incentives, and they’re full of biases.\n\nYou’ll easily be manipulated for someone else’s profit.\n\nTo join the biggest wealth transfer in history, you must question everything and keep an open mind. This opportunity never existed before social media. Now it does.\n\n# Part 2 – AI agents will change everything forever\n\nMost people know what AI is.\n\nIn the last 8 weeks AI agents have quietly been gaining traction. Yesterday I learned a guy online is teaching people how to use AI agents to write their own software code without any knowledge of how code works.\n\nAI agents act like human beings. You tell them what you need done and they do it. At the start of this trend you could tell them to book a meeting. Then they could do your taxes. Now they can write you personalized software. Tomorrow they can show up at your job and do most of the work for you.\n\nAnd many are getting left behind because they’re stuck in the old way of thinking. They still think websites or google search matter.\n\nAI agents are creating a bigger wealth transfer than the internet did. Amplifying how much you can get done with AI agents is an opportunity that’ll create a new class of millionaires.\n\nLow IQ donkey work will get destroyed. That means basic jobs will be out the door – and they’re the ones that need college degrees.\n\n# Part 3 – Employment versus one-person businesses\n\nDissing 9-5 jobs has been fashionable since the early 2000s.\n\nPreviously this idea was mostly a get-rich-scheme… but now it’s a reality. The average person is realizing they’re a business, and being loyal to a corporation is the fastest way to get taken advantage of, because the company isn’t loyal to them.\n\nAggressive layoffs have shown the true colors of the corporate world.\n\nAnd all the “we are family” and “wear this rainbow badge” or “be part of Black History Month” have been a giant facade.\n\nCorporations don’t care about you or any cause. They exist for profit. That’s all.\n\nI’m not hating on the model. This is how it should be and always has been. HR departments just got out of control and became glorified marketing departments.\n\nAs this reality has hit workers hard, the idea of working for themselves and servicing multiple companies has become common. The tools needed to do this and the ways to attract customers have become easier.\n\nIt’s better for corporations too. When they hire a full-time employee they often don’t need that person for every second of the day. With this one-person business model a company can recruit some guns-for-hire, then discard them when the work is done.\n\nThis turns the workforce into being value-led, not a “years of experience” or useless credentials-driven system.\n\nAs these dynamics shift, high agency people with real skills will earn a lot more money and work with multiple companies at the same time.\n\nAnd low value employee work will continue to decline and have harsher KPIs applied that ultimately lead to layoffs.\n\nJust talk to someone working 12-hour days.\n\nThey’re being exploited because they’re not properly selling the value they have to offer. So when an employer says jump, they have to do everything they say and more or the threat of layoffs will take away their livelihood.\n\nThis exploitation model will die.\n\nThe opportunity for you is to turn yourself into a business and to think like one. That way you’ll never starve or be out of work.\n\n# Part 4 – Busy versus obsessed\n\nThe rise of technology has been a blessing and a curse.\n\nThe average person is busier than ever because technology has given us endless distractions and tasks to do. The uneducated think being busy is a sign of success.\n\n> But being busy just means you can’t focus.\n\nBut being busy just means you can’t focus.\n\nThat’s not something to be proud of. It’s a tragedy. It means you can’t direct your attention, time, and money toward the right goal.\n\nThanks to modern science and cutting-edge books on how humans think and work, a new class of humans has risen up. They’re the obsessed.\n\n* They refuse to be busy.\n* They focus on one thing.\n* They ignore shiny objects.\n* They build one thing online for 5+ years.\n\nThey refuse to be busy.\n\nThey focus on one thing.\n\nThey ignore shiny objects.\n\nThey build one thing online for 5+ years.\n\nBecause social media like TikTok and streaming TV like Netflix have been rotting most people’s minds, the people who resisted the cheap dopamine have been given a huge advantage.\n\nThe obsessed class is able to make progress faster.\n\nAnd they have almost no competition so they’re making much more money than they should. To be part of this wealth transfer you must choose obsession.\n\n# Part 5 – Crypto versus old world money\n\nThe old world of finance was based on buying index funds or investing in the S&P 500.\n\nOr you could buy bonds and earn interest. Or invest in your favorite company when they listed on the stock exchange.\n\nBut then this happened…\n\n* Governments created record amounts of money out of thin air. This messed with our ability to get true price discovery on how much things are worth, like how much a loaf of bread really costs.\n* The return on index funds is before tax and is less than the devaluing of the global money supply that governments and central banks are responsible for. Plus, investing for decades in the markets to get rich at 85 (or never) isn’t appealing anymore.\n* Governments created massive debts that they can never pay back, and will never be paid back.\n* Bonds pay peanuts in interest and the value of money is working against you.\n* Stock market apps came out of nowhere. They let people take stupid risks and make wild bets. Coordinated manipulation of stocks like Game Stop became common.\n* Buying your favorite public company became harder because of derivatives (gambling), and insiders like venture capitalists milking all the value out of a company before they list it on the stock exchange to dump it on retail investors and collect the cash they feel like they earned.\n* Sanctions and cancel culture meant if you started a war in the Ukraine or said the wrong thing online, you could have your bank accounts frozen or even closed.\n* Middlemen fintech companies began raping businesses 5-6% to process a simple card transaction from their customers, then smacking them again with currency conversion fees for doing nothing.\n\nGovernments created record amounts of money out of thin air. This messed with our ability to get true price discovery on how much things are worth, like how much a loaf of bread really costs.\n\nThe return on index funds is before tax and is less than the devaluing of the global money supply that governments and central banks are responsible for. Plus, investing for decades in the markets to get rich at 85 (or never) isn’t appealing anymore.\n\nGovernments created massive debts that they can never pay back, and will never be paid back.\n\nBonds pay peanuts in interest and the value of money is working against you.\n\nStock market apps came out of nowhere. They let people take stupid risks and make wild bets. Coordinated manipulation of stocks like Game Stop became common.\n\nBuying your favorite public company became harder because of derivatives (gambling), and insiders like venture capitalists milking all the value out of a company before they list it on the stock exchange to dump it on retail investors and collect the cash they feel like they earned.\n\nSanctions and cancel culture meant if you started a war in the Ukraine or said the wrong thing online, you could have your bank accounts frozen or even closed.\n\nMiddlemen fintech companies began raping businesses 5-6% to process a simple card transaction from their customers, then smacking them again with currency conversion fees for doing nothing.\n\nSo over the last few years a new financial system has been built on blockchain. Some call it crypto. Others call it decentralized finance. Some know it as Bitcoin. Whatever the heck you call it, it came from a desperate need for a better way.\n\nSince 2013 I’ve benefited from it. I saw the problems early on when I worked in banking. I remember an Aussie customer wanting to send money to their supplier in Brazil.\n\nThey asked me how much it would cost to send the money. I couldn’t tell them because all the middlemen banks that would be involved have wildly fluctuating fees.\n\nOn day one the customer sent the money. 2 weeks later their supplier still didn’t have the money. They asked me for an update. I asked our bank.\n\nThey sent an internal message to the other bank (like an SMS). Days later a reply came back with one word: “Processing.” This went on for weeks. The banks in the middle joked. I later found out the intermediary banks wanted to hold the money for as long as possible to make money off it.\n\nIt was all a big joke.\n\nThe customer was the loser. Their money finally arrived minus a massive chunk of it missing to pay all the fees.\n\nThis led me to invest in blockchain technology, which automates all this BS and makes the fees and transactions available on a public ledger. It started with Bitcoin then morphed into 1000s of cryptos.\n\nOld world money still hasn’t caught on.\n\nThey don’t understand that measuring the value of anything in a government-issued currency is a huge mistake because the supply is inflating and infinite.\n\nThe wealth transfer to this new world of finance has created some extremely rich people. It takes an open mind to understand. For AI to operate the way it needs to, automated financial transactions that happen in real time are a must.\n\nCrypto is so obvious it’s not even funny at this point.\n\n# Part 6 – A radical change in mindset\n\nAbout 2 years ago it hit me: wealth is created in the mind.\n\nNot through waiting your turn, luck, hope, a Kickstarter crowdfunding campaign (lottery), being chosen, a Hollywood movie deal, or because you deserve it.\n\nChanging your mind used to be hard. Then social media came along with its algorithms. It allowed you to follow people and ideas. As you subconsciously selected what you’d follow, your mindset changed for better or worse.\n\nSome people followed dumb-dumbs on platforms like Medium who said “America is burning. Nothing can save us now.”\n\nOthers joined platforms like X or this one and followed optimistic people. They found new ideas. They challenged everything they learned at school. And they adopted a growth mindset.\n\nSocial media has and will continue to be part of the largest wealth transfer in history.\n\nIt’s where you:\n\n* Build distribution\n* Get attention for your ideas\n* Network with smart people\n\nBuild distribution\n\nGet attention for your ideas\n\nNetwork with smart people\n\nThe “follow” button is perhaps the most powerful button in history.\n\n# Final Thought\n\nThis is the golden era of humanity.\n\nI’ve never been more optimistic. The opportunities have never been this good and are only getting better. Use the 6 parts above to join the new economy and be part of the greatest wealth transfer in history.\n\nUse the money to create generational wealth, set your mind free, and buy back your time. You deserve it. What’s holding you back?\n\nThis article is for informational purposes only, it should not be considered Financial or Legal Advice. Consult a financial professional before making any major financial decisions.\n\n---\n\nI send this email weekly. If you would also like to receive it, join the 134,000+ other smart people who absolutely love it today.\n\n👉 If you enjoy reading this post, feel free to share it with friends! Or feel free to click the ❤️ button on this post so more people can discover it on Substack 🙏\n\nShare"
    }
  ],
  "main_content": "# The Biggest Wealth Transfer in History Is Happening Right Now\n\n### You can be a part of it if you choose.\n\nShare\n\nTrillions of dollars are flowing right now.\n\nMost people are missing it. They’re asleep at the wheel of their life heading off a cliff. They’re using the country where they live as an excuse, despite them being connected to the internet.\n\nBig idea: The internet removed country borders.\n\nWhere you come from is irrelevant. Who your parents were or what college education you have is as meaningless as the fact I’m wearing bright red underpants right now with pink stains on them.\n\nThe wealth transfer going on is wild.\n\nI’m right in the middle of it. I feel like Gandalf from the Lord of the Rings movie with the ability to see the future and navigate people through it.\n\nThere’s a lot of hype. The noise is deafening. At the core of it is the truth which is hard to see. Some people still don’t understand the foundation of the global economy.\n\nThey keep saying “there’s so much debt” without understanding the debt will never be paid back. They wonder why the money they earn each year buys less and less and they can’t figure out why.\n\nLet me decode for you the biggest wealth transfer in history (bigger than the baby boomer boom) into 6 parts.\n\n# Part 1 – Programmed minds versus the free mind\n\nFor as long as we’ve had TVs, newspapers, and radio we’ve been subconsciously programmed by the mass media.\n\nThe cracks appeared when we started to learn how Hollywood used tricks to make movies. Or when they edited true stories to make them something they weren’t to increase the marketability of the movie.\n\n> Bottom line: mainstream media will fake anything for the right reason.\n\nBottom line: mainstream media will fake anything for the right reason.\n\nBefore the internet’s supremacy most of us had a programmed mind. Then social media rose to dominance and gave us the chance to opt out and program our minds the way we saw fit.\n\nThis has given a segment of society a massive advantage. By freeing their minds they’ve been able to create results that seem impossible.\n\nBut most minds still aren’t free. I’ll give you an example. If you ask the average person about Elon Musk, many will say they hate him. My uncle is one of those people.\n\nHe wants to murder Elon.\n\nSo I asked my uncle why he didn’t like Elon.\n\n“He’s evil. He’s a dangerous man. He’s Hitler.”\n\nThen I say “Have you ever had dinner with Elon?”\n\nNo.\n\n“Have you ever met Elon?”\n\nNo.\n\n“Do you know anyone who knows Elon?”\n\nNo.\n\n“So how do you know these things about Elon, uncle?”\n\nThe answer is the media told him these things. They programmed his mind. The mainstream media does this because they’re driven by incentives, and they’re full of biases.\n\nYou’ll easily be manipulated for someone else’s profit.\n\nTo join the biggest wealth transfer in history, you must question everything and keep an open mind. This opportunity never existed before social media. Now it does.\n\n# Part 2 – AI agents will change everything forever\n\nMost people know what AI is.\n\nIn the last 8 weeks AI agents have quietly been gaining traction. Yesterday I learned a guy online is teaching people how to use AI agents to write their own software code without any knowledge of how code works.\n\nAI agents act like human beings. You tell them what you need done and they do it. At the start of this trend you could tell them to book a meeting. Then they could do your taxes. Now they can write you personalized software. Tomorrow they can show up at your job and do most of the work for you.\n\nAnd many are getting left behind because they’re stuck in the old way of thinking. They still think websites or google search matter.\n\nAI agents are creating a bigger wealth transfer than the internet did. Amplifying how much you can get done with AI agents is an opportunity that’ll create a new class of millionaires.\n\nLow IQ donkey work will get destroyed. That means basic jobs will be out the door – and they’re the ones that need college degrees.\n\n# Part 3 – Employment versus one-person businesses\n\nDissing 9-5 jobs has been fashionable since the early 2000s.\n\nPreviously this idea was mostly a get-rich-scheme… but now it’s a reality. The average person is realizing they’re a business, and being loyal to a corporation is the fastest way to get taken advantage of, because the company isn’t loyal to them.\n\nAggressive layoffs have shown the true colors of the corporate world.\n\nAnd all the “we are family” and “wear this rainbow badge” or “be part of Black History Month” have been a giant facade.\n\nCorporations don’t care about you or any cause. They exist for profit. That’s all.\n\nI’m not hating on the model. This is how it should be and always has been. HR departments just got out of control and became glorified marketing departments.\n\nAs this reality has hit workers hard, the idea of working for themselves and servicing multiple companies has become common. The tools needed to do this and the ways to attract customers have become easier.\n\nIt’s better for corporations too. When they hire a full-time employee they often don’t need that person for every second of the day. With this one-person business model a company can recruit some guns-for-hire, then discard them when the work is done.\n\nThis turns the workforce into being value-led, not a “years of experience” or useless credentials-driven system.\n\nAs these dynamics shift, high agency people with real skills will earn a lot more money and work with multiple companies at the same time.\n\nAnd low value employee work will continue to decline and have harsher KPIs applied that ultimately lead to layoffs.\n\nJust talk to someone working 12-hour days.\n\nThey’re being exploited because they’re not properly selling the value they have to offer. So when an employer says jump, they have to do everything they say and more or the threat of layoffs will take away their livelihood.\n\nThis exploitation model will die.\n\nThe opportunity for you is to turn yourself into a business and to think like one. That way you’ll never starve or be out of work.\n\n# Part 4 – Busy versus obsessed\n\nThe rise of technology has been a blessing and a curse.\n\nThe average person is busier than ever because technology has given us endless distractions and tasks to do. The uneducated think being busy is a sign of success.\n\n> But being busy just means you can’t focus.\n\nBut being busy just means you can’t focus.\n\nThat’s not something to be proud of. It’s a tragedy. It means you can’t direct your attention, time, and money toward the right goal.\n\nThanks to modern science and cutting-edge books on how humans think and work, a new class of humans has risen up. They’re the obsessed.\n\n* They refuse to be busy.\n* They focus on one thing.\n* They ignore shiny objects.\n* They build one thing online for 5+ years.\n\nThey refuse to be busy.\n\nThey focus on one thing.\n\nThey ignore shiny objects.\n\nThey build one thing online for 5+ years.\n\nBecause social media like TikTok and streaming TV like Netflix have been rotting most people’s minds, the people who resisted the cheap dopamine have been given a huge advantage.\n\nThe obsessed class is able to make progress faster.\n\nAnd they have almost no competition so they’re making much more money than they should. To be part of this wealth transfer you must choose obsession.\n\n# Part 5 – Crypto versus old world money\n\nThe old world of finance was based on buying index funds or investing in the S&P 500.\n\nOr you could buy bonds and earn interest. Or invest in your favorite company when they listed on the stock exchange.\n\nBut then this happened…\n\n* Governments created record amounts of money out of thin air. This messed with our ability to get true price discovery on how much things are worth, like how much a loaf of bread really costs.\n* The return on index funds is before tax and is less than the devaluing of the global money supply that governments and central banks are responsible for. Plus, investing for decades in the markets to get rich at 85 (or never) isn’t appealing anymore.\n* Governments created massive debts that they can never pay back, and will never be paid back.\n* Bonds pay peanuts in interest and the value of money is working against you.\n* Stock market apps came out of nowhere. They let people take stupid risks and make wild bets. Coordinated manipulation of stocks like Game Stop became common.\n* Buying your favorite public company became harder because of derivatives (gambling), and insiders like venture capitalists milking all the value out of a company before they list it on the stock exchange to dump it on retail investors and collect the cash they feel like they earned.\n* Sanctions and cancel culture meant if you started a war in the Ukraine or said the wrong thing online, you could have your bank accounts frozen or even closed.\n* Middlemen fintech companies began raping businesses 5-6% to process a simple card transaction from their customers, then smacking them again with currency conversion fees for doing nothing.\n\nGovernments created record amounts of money out of thin air. This messed with our ability to get true price discovery on how much things are worth, like how much a loaf of bread really costs.\n\nThe return on index funds is before tax and is less than the devaluing of the global money supply that governments and central banks are responsible for. Plus, investing for decades in the markets to get rich at 85 (or never) isn’t appealing anymore.\n\nGovernments created massive debts that they can never pay back, and will never be paid back.\n\nBonds pay peanuts in interest and the value of money is working against you.\n\nStock market apps came out of nowhere. They let people take stupid risks and make wild bets. Coordinated manipulation of stocks like Game Stop became common.\n\nBuying your favorite public company became harder because of derivatives (gambling), and insiders like venture capitalists milking all the value out of a company before they list it on the stock exchange to dump it on retail investors and collect the cash they feel like they earned.\n\nSanctions and cancel culture meant if you started a war in the Ukraine or said the wrong thing online, you could have your bank accounts frozen or even closed.\n\nMiddlemen fintech companies began raping businesses 5-6% to process a simple card transaction from their customers, then smacking them again with currency conversion fees for doing nothing.\n\nSo over the last few years a new financial system has been built on blockchain. Some call it crypto. Others call it decentralized finance. Some know it as Bitcoin. Whatever the heck you call it, it came from a desperate need for a better way.\n\nSince 2013 I’ve benefited from it. I saw the problems early on when I worked in banking. I remember an Aussie customer wanting to send money to their supplier in Brazil.\n\nThey asked me how much it would cost to send the money. I couldn’t tell them because all the middlemen banks that would be involved have wildly fluctuating fees.\n\nOn day one the customer sent the money. 2 weeks later their supplier still didn’t have the money. They asked me for an update. I asked our bank.\n\nThey sent an internal message to the other bank (like an SMS). Days later a reply came back with one word: “Processing.” This went on for weeks. The banks in the middle joked. I later found out the intermediary banks wanted to hold the money for as long as possible to make money off it.\n\nIt was all a big joke.\n\nThe customer was the loser. Their money finally arrived minus a massive chunk of it missing to pay all the fees.\n\nThis led me to invest in blockchain technology, which automates all this BS and makes the fees and transactions available on a public ledger. It started with Bitcoin then morphed into 1000s of cryptos.\n\nOld world money still hasn’t caught on.\n\nThey don’t understand that measuring the value of anything in a government-issued currency is a huge mistake because the supply is inflating and infinite.\n\nThe wealth transfer to this new world of finance has created some extremely rich people. It takes an open mind to understand. For AI to operate the way it needs to, automated financial transactions that happen in real time are a must.\n\nCrypto is so obvious it’s not even funny at this point.\n\n# Part 6 – A radical change in mindset\n\nAbout 2 years ago it hit me: wealth is created in the mind.\n\nNot through waiting your turn, luck, hope, a Kickstarter crowdfunding campaign (lottery), being chosen, a Hollywood movie deal, or because you deserve it.\n\nChanging your mind used to be hard. Then social media came along with its algorithms. It allowed you to follow people and ideas. As you subconsciously selected what you’d follow, your mindset changed for better or worse.\n\nSome people followed dumb-dumbs on platforms like Medium who said “America is burning. Nothing can save us now.”\n\nOthers joined platforms like X or this one and followed optimistic people. They found new ideas. They challenged everything they learned at school. And they adopted a growth mindset.\n\nSocial media has and will continue to be part of the largest wealth transfer in history.\n\nIt’s where you:\n\n* Build distribution\n* Get attention for your ideas\n* Network with smart people\n\nBuild distribution\n\nGet attention for your ideas\n\nNetwork with smart people\n\nThe “follow” button is perhaps the most powerful button in history.\n\n# Final Thought\n\nThis is the golden era of humanity.\n\nI’ve never been more optimistic. The opportunities have never been this good and are only getting better. Use the 6 parts above to join the new economy and be part of the greatest wealth transfer in history.\n\nUse the money to create generational wealth, set your mind free, and buy back your time. You deserve it. What’s holding you back?\n\nThis article is for informational purposes only, it should not be considered Financial or Legal Advice. Consult a financial professional before making any major financial decisions.\n\n---\n\nI send this email weekly. If you would also like to receive it, join the 134,000+ other smart people who absolutely love it today.\n\n👉 If you enjoy reading this post, feel free to share it with friends! Or feel free to click the ❤️ button on this post so more people can discover it on Substack 🙏\n\nShare",
  "word_count": 2502,
  "reading_time_minutes": 13
}