{
  "id": "the-secret-life-of-people-with-high-agency-its-simpler-than-you-think",
  "source": "tim_denning",
  "title": "The Secret Life of People with High Agency (It’s Simpler than You Think)",
  "author": "Tim Denning",
  "date": null,
  "source_url": "https://timdenning.substack.com/p/the-secret-life-of-people-with-high",
  "topics": [
    "Secret",
    "Life",
    "People",
    "With",
    "High"
  ],
  "sections": [
    {
      "heading": "Main",
      "content": "# The Secret Life of People with High Agency (It’s Simpler than You Think)\n\n### It's bizarrely good for your health too\n\nShare\n\nThese two bastards are now millionaires.\n\nWe worked in banking together. We earned minimum wage. They’re now both on $1M+ a year. I found this out secretly in December.\n\nI was chatting to an old banking friend. “What are Peter and Smaz doing these days?” Last I checked one was in management consulting & the other worked at a different bank. My friend says to check their LinkedIn profiles. I do.\n\nPeter and Smaz appear to be unemployed.\n\nThen she tells me that’s just for show. Both of them got hired back by our old banking employer. Instead of being employees it’s different this time.\n\nThey were recruited by a senior executive as guns for hire. They got to demand how much they get paid, they’re contractors using their LLC companies, they don’t have to wear suit and tie and they roll up to the office in shorts and thongs, they start and finish work whenever they want, and they can hire anyone onto their team they like.\n\nBoth of them are Mr Nice Guys.\n\nPeter has puppy dog eyes, boring fashion, two kids, and a normal-looking wife. Smaz is a slow talker with more humility than Gandhi. He still plays video games in his 30s and looks about 16 years old. When he buys beer he still gets asked for ID.\n\nThey’re real sons of b*tches if you ask me. And I love ‘em.\n\nSo why do they get to earn $1M+ a year and live this secret dream while appearing on LinkedIn like they’re unemployed? I can tell you. I worked with both of them daily.\n\nIt’s because they have extremely high agency.\n\nThey’re not super smart and neither of them went to university, but they can solve almost any banking problem.\n\nThey often don’t have the answer. But they can find the person who does and work with them to solve the problem. As the executive who hired them once said, “they’re get sh*t done kind of people and those mofos are rare these days.”\n\nBeing high agency is the single most important trait if you want to be successful, experience personal freedom, and become wealthy.\n\nThanks to these two geeks, I learned how to be high agency from them. It helped me quit banking forever and do whatever the heck I want.\n\nHere’s what their secret life of being high agency looks like.\n\n# When we’re resourceful we become unstoppable\n\nHigh agency people have a bias for action.\n\nThey believe everything is a story and they can change an outcome through their influence. They know if they don’t have a solution they can always find one.\n\nPsychologist Nick Wignall describes it like this:\n\n> People with a low agency mindset tend to be passive, reactive, and fatalistic. They see life as something that happens to them over which they have little control or responsibility. They frequently feel like a victim of circumstances and tend to see themselves as a supporting character in other people’s stories.People with a high agency mindset are active, enthusiastic, and optimistic. They view life as something they do over which they have great control and responsibility. They view themselves as the hero and author of their own story.\n\nPeople with a low agency mindset tend to be passive, reactive, and fatalistic. They see life as something that happens to them over which they have little control or responsibility. They frequently feel like a victim of circumstances and tend to see themselves as a supporting character in other people’s stories.\n\nPeople with a high agency mindset are active, enthusiastic, and optimistic. They view life as something they do over which they have great control and responsibility. They view themselves as the hero and author of their own story.\n\nShreyas Doshi on LinkedIn has another view of high agency:\n\nMan, I’ve met a lot of frustrated geniuses who think their sh*t doesn’t stink.\n\nPeter and Smaz have one trait that’s in common with all high agency people I’ve met: they have humility. Their ego doesn’t run their life. They’re not afraid to ask for help. And they can be wrong and not break down crying like my 2 year old toddler.\n\nIf you don’t choose to be high agency, you run the risk of being a cog in the machine who lives like a robot. Or you may make your way up to being a go-getter, but you’ll always be asking some moron gatekeeper for permission.\n\nHigh agency people are game changers.\n\n* They’re leaders.\n* They build movements.\n* They change the world.\n\nThey’re leaders.\n\nThey build movements.\n\nThey change the world.\n\nThis is a way of life you must choose.\n\nSteve Jobs was an a**hole to his employees and refused to pay the vehicle registration on his Mercedes Benz. But man was he high agency.\n\nThis is the idea that led him to be that way:\n\n“Life can be much broader once you discover one simple fact: Everything around you that you call life was made up by people that were no smarter than you and you can change it, you can influence it, you can build your own things that other people can use.”\n\n# The secret life of a billionaire turned prison inmate\n\nIn the 90s, my mother was obsessed with Martha Stewart.\n\nShe had all her cookbooks and wanted to decorate our modest home to look like a perfect little Martha doll house with an extravagant garden.\n\nIt really pissed me off. So fake.\n\nMartha built a business around her upmarket lifestyle approach and became a billionaire. Her company listed on the New York Stock Exchange.\n\nShe was described as little miss perfect who could do no wrong.\n\nThen in the early 2000s a scandal broke out. She was accused of insider trading.\n\nThe charges didn’t stick. So the prosecution went after Martha on a witch hunt. They said she had knowledge of a company named ImClone that was about to collapse and she sold her stock ($240K) in the company as a result.\n\nShe ended up losing the case. She went to jail and lost everything. When she finally got out of jail she became a puppet and worked for Michael Burnett on a new daily tv show called Martha.\n\nShe hated her life.\n\nThe years progressed. Life was hard. In 2016 she appeared on a comedy roast of Justin Bieber. She was badass. People loved how she mocked herself and made fun of Justin.\n\nOne of the other guests on the show was Snoop Dog.\n\nA rich white woman and a gangster rapper were hardly a match made in a virgin church. But they hit it off. Snoop smoked lots of blunts. Martha sat next to him and inhaled the fumes, so she got high.\n\nThey went into business together. It became the start of a comeback.\n\nThen Martha discovered social media and became the first grandma influencer. Now she’s back on top again and disgustingly rich. No matter how bad things get, a person with high agency can always make a comeback.\n\nThey don’t let rock bottom slow them down or force them to stand still. Nope. They use it as a platform. They make it part of their story. And they own their f*ck ups which makes them more authentic.\n\nAny one of us can act like Martha and make a comeback.\n\n# Being high agency makes you wealthier than you deserve\n\nI used to think wealth was a set of skills.\n\nNow I think wealth is simply a mindset. You either have it or you don’t. And if you don’t, you can use high agency principles to develop a wealthy mindset.\n\nHigh agency people are rare. It’s only the top 1% of society who have chosen to live this way. That means there’s almost zero competition.\n\nIf you’re high agency you get sh*t done, have a bias for action, and therefore get results – while everyone else is distracted and staring at a phone screen.\n\nThis means you get paid more money. Because we’re paid for results – not job titles, qualifications, degrees, or self-assigned labels.\n\nPeter and Smaz are proof – average people with extremely high agency.\n\nTheir value in the market is whatever they want. Each year their income goes up exponentially. They don’t apply for opportunities. No. They have endless inbound requests and say no to most of them.\n\nI’m lucky to live this way thanks to this high agency mindset. I spend my days saying no to almost everyone.\n\nOnce you’re high agency your mind becomes like a filter. You have one true purpose and everything that doesn’t align with it goes in the trash.\n\nIt means you live true to who you are and know what you stand for. You’re congruent with who you are, so you act authentically and people bizarrely praise you for this authenticity.\n\nAs the opportunities stack up, you must hand out more noes. That means the price of working with you rises because you have too much demand. So you become unusually wealthy without being brilliant, smart, or having Warren Buffett investment skills.\n\n# Being high agency is bizarrely good for your health\n\nPeople who don’t get results feel bad.\n\nThey feel unproductive. They get mad at themselves. Their low agency behavior causes them to struggle financially. This all creates anxiety.\n\nIf the anxiety persists long enough, it turns into regrets that can cause people to experience a dark downward spiral.\n\n> “Most people live a quietly anxious life because they know they should be doing something other than what they're doing, but they don't do anything about it because they don't know what to do, so they keep doing the same thing to numb the pain that comes with change”– Dan Koe\n\n“Most people live a quietly anxious life because they know they should be doing something other than what they're doing, but they don't do anything about it because they don't know what to do, so they keep doing the same thing to numb the pain that comes with change”\n\n– Dan Koe\n\nWhen you act high agency you focus on execution and moving forward. This relieves a a lot of stress because you get glimmers of hope through the small daily progress.\n\nPsychologist Nick Wignall goes a step further:\n\n“One of the deep causes of chronic worry is that we use it as a defense mechanism against helplessness and perceived lack of control. Because worry feels productive, it gives us the illusion of control, which temporarily alleviates anxiety but increases it long-term.”\n\nHigh agency behavior helps you gain real control.\n\n# Being high agency is a refusal to accept the status quo\n\nThis dude emailed me today.\n\n“Elon’s X platform is going bankrupt and he’s losing his fortune. Join my program and I’ll teach you, Tim, how to find real financial success.”\n\nI laughed out loud.\n\nElon may be a schoolboy who makes d*ck jokes and has a personality I personally don’t resonate with, but he’s not going bankrupt. Quite the opposite. His net worth is exploding because his businesses cover self-driving cars, robots, AI, social media, renewable energy, and space travel.\n\nThis reader of mine is low agency because they’re stuck in the status quo of a year ago when mainstream media went on an Elon rampage. Temporarily it looked like there was trouble in paradise with Elon but it didn’t last.\n\nHe reversed the damage through relentless execution.\n\nHigh agency people are the opposite.\n\n* They have an open mind.\n* They can reverse course when the facts change.\n* They don’t hold onto opinions from years ago because it feels delicious and fits with some child-like view of politics.\n\nThey have an open mind.\n\nThey can reverse course when the facts change.\n\nThey don’t hold onto opinions from years ago because it feels delicious and fits with some child-like view of politics.\n\n# Being high agency makes you more likable\n\nHigh agency people are more likable because they have social proof.\n\nThey can show you evidence of their capability. They don’t rely on fake references, “featured in CNBC,” and letters after their name to do the talking for them.\n\nThis reality makes you more helpful. And we love helpful people. Being high agency makes you more confident, too, because you’ve got real achievements. That confidence shows up in how you act around others.\n\nThe confidence becomes charm… rather than arrogance and an inflated ego which is what the frustrated geniuses have.\n\n# Final Thought\n\nThe average person is low agency and lives like a machine. They get told what to do, feel unfulfilled, and are lost. This is no way to live.\n\nAdopt the high agency way of life and watch it change your life.\n\n---\n\nP.S. Next week, I'm announcing a brand new challenge, ideal for people who have (or want) high agency.\n\nThe goal: Creating a new revenue stream in just 1 weekend.\n\nWant early access?\n\nHit reply and tell me."
    }
  ],
  "main_content": "# The Secret Life of People with High Agency (It’s Simpler than You Think)\n\n### It's bizarrely good for your health too\n\nShare\n\nThese two bastards are now millionaires.\n\nWe worked in banking together. We earned minimum wage. They’re now both on $1M+ a year. I found this out secretly in December.\n\nI was chatting to an old banking friend. “What are Peter and Smaz doing these days?” Last I checked one was in management consulting & the other worked at a different bank. My friend says to check their LinkedIn profiles. I do.\n\nPeter and Smaz appear to be unemployed.\n\nThen she tells me that’s just for show. Both of them got hired back by our old banking employer. Instead of being employees it’s different this time.\n\nThey were recruited by a senior executive as guns for hire. They got to demand how much they get paid, they’re contractors using their LLC companies, they don’t have to wear suit and tie and they roll up to the office in shorts and thongs, they start and finish work whenever they want, and they can hire anyone onto their team they like.\n\nBoth of them are Mr Nice Guys.\n\nPeter has puppy dog eyes, boring fashion, two kids, and a normal-looking wife. Smaz is a slow talker with more humility than Gandhi. He still plays video games in his 30s and looks about 16 years old. When he buys beer he still gets asked for ID.\n\nThey’re real sons of b*tches if you ask me. And I love ‘em.\n\nSo why do they get to earn $1M+ a year and live this secret dream while appearing on LinkedIn like they’re unemployed? I can tell you. I worked with both of them daily.\n\nIt’s because they have extremely high agency.\n\nThey’re not super smart and neither of them went to university, but they can solve almost any banking problem.\n\nThey often don’t have the answer. But they can find the person who does and work with them to solve the problem. As the executive who hired them once said, “they’re get sh*t done kind of people and those mofos are rare these days.”\n\nBeing high agency is the single most important trait if you want to be successful, experience personal freedom, and become wealthy.\n\nThanks to these two geeks, I learned how to be high agency from them. It helped me quit banking forever and do whatever the heck I want.\n\nHere’s what their secret life of being high agency looks like.\n\n# When we’re resourceful we become unstoppable\n\nHigh agency people have a bias for action.\n\nThey believe everything is a story and they can change an outcome through their influence. They know if they don’t have a solution they can always find one.\n\nPsychologist Nick Wignall describes it like this:\n\n> People with a low agency mindset tend to be passive, reactive, and fatalistic. They see life as something that happens to them over which they have little control or responsibility. They frequently feel like a victim of circumstances and tend to see themselves as a supporting character in other people’s stories.People with a high agency mindset are active, enthusiastic, and optimistic. They view life as something they do over which they have great control and responsibility. They view themselves as the hero and author of their own story.\n\nPeople with a low agency mindset tend to be passive, reactive, and fatalistic. They see life as something that happens to them over which they have little control or responsibility. They frequently feel like a victim of circumstances and tend to see themselves as a supporting character in other people’s stories.\n\nPeople with a high agency mindset are active, enthusiastic, and optimistic. They view life as something they do over which they have great control and responsibility. They view themselves as the hero and author of their own story.\n\nShreyas Doshi on LinkedIn has another view of high agency:\n\nMan, I’ve met a lot of frustrated geniuses who think their sh*t doesn’t stink.\n\nPeter and Smaz have one trait that’s in common with all high agency people I’ve met: they have humility. Their ego doesn’t run their life. They’re not afraid to ask for help. And they can be wrong and not break down crying like my 2 year old toddler.\n\nIf you don’t choose to be high agency, you run the risk of being a cog in the machine who lives like a robot. Or you may make your way up to being a go-getter, but you’ll always be asking some moron gatekeeper for permission.\n\nHigh agency people are game changers.\n\n* They’re leaders.\n* They build movements.\n* They change the world.\n\nThey’re leaders.\n\nThey build movements.\n\nThey change the world.\n\nThis is a way of life you must choose.\n\nSteve Jobs was an a**hole to his employees and refused to pay the vehicle registration on his Mercedes Benz. But man was he high agency.\n\nThis is the idea that led him to be that way:\n\n“Life can be much broader once you discover one simple fact: Everything around you that you call life was made up by people that were no smarter than you and you can change it, you can influence it, you can build your own things that other people can use.”\n\n# The secret life of a billionaire turned prison inmate\n\nIn the 90s, my mother was obsessed with Martha Stewart.\n\nShe had all her cookbooks and wanted to decorate our modest home to look like a perfect little Martha doll house with an extravagant garden.\n\nIt really pissed me off. So fake.\n\nMartha built a business around her upmarket lifestyle approach and became a billionaire. Her company listed on the New York Stock Exchange.\n\nShe was described as little miss perfect who could do no wrong.\n\nThen in the early 2000s a scandal broke out. She was accused of insider trading.\n\nThe charges didn’t stick. So the prosecution went after Martha on a witch hunt. They said she had knowledge of a company named ImClone that was about to collapse and she sold her stock ($240K) in the company as a result.\n\nShe ended up losing the case. She went to jail and lost everything. When she finally got out of jail she became a puppet and worked for Michael Burnett on a new daily tv show called Martha.\n\nShe hated her life.\n\nThe years progressed. Life was hard. In 2016 she appeared on a comedy roast of Justin Bieber. She was badass. People loved how she mocked herself and made fun of Justin.\n\nOne of the other guests on the show was Snoop Dog.\n\nA rich white woman and a gangster rapper were hardly a match made in a virgin church. But they hit it off. Snoop smoked lots of blunts. Martha sat next to him and inhaled the fumes, so she got high.\n\nThey went into business together. It became the start of a comeback.\n\nThen Martha discovered social media and became the first grandma influencer. Now she’s back on top again and disgustingly rich. No matter how bad things get, a person with high agency can always make a comeback.\n\nThey don’t let rock bottom slow them down or force them to stand still. Nope. They use it as a platform. They make it part of their story. And they own their f*ck ups which makes them more authentic.\n\nAny one of us can act like Martha and make a comeback.\n\n# Being high agency makes you wealthier than you deserve\n\nI used to think wealth was a set of skills.\n\nNow I think wealth is simply a mindset. You either have it or you don’t. And if you don’t, you can use high agency principles to develop a wealthy mindset.\n\nHigh agency people are rare. It’s only the top 1% of society who have chosen to live this way. That means there’s almost zero competition.\n\nIf you’re high agency you get sh*t done, have a bias for action, and therefore get results – while everyone else is distracted and staring at a phone screen.\n\nThis means you get paid more money. Because we’re paid for results – not job titles, qualifications, degrees, or self-assigned labels.\n\nPeter and Smaz are proof – average people with extremely high agency.\n\nTheir value in the market is whatever they want. Each year their income goes up exponentially. They don’t apply for opportunities. No. They have endless inbound requests and say no to most of them.\n\nI’m lucky to live this way thanks to this high agency mindset. I spend my days saying no to almost everyone.\n\nOnce you’re high agency your mind becomes like a filter. You have one true purpose and everything that doesn’t align with it goes in the trash.\n\nIt means you live true to who you are and know what you stand for. You’re congruent with who you are, so you act authentically and people bizarrely praise you for this authenticity.\n\nAs the opportunities stack up, you must hand out more noes. That means the price of working with you rises because you have too much demand. So you become unusually wealthy without being brilliant, smart, or having Warren Buffett investment skills.\n\n# Being high agency is bizarrely good for your health\n\nPeople who don’t get results feel bad.\n\nThey feel unproductive. They get mad at themselves. Their low agency behavior causes them to struggle financially. This all creates anxiety.\n\nIf the anxiety persists long enough, it turns into regrets that can cause people to experience a dark downward spiral.\n\n> “Most people live a quietly anxious life because they know they should be doing something other than what they're doing, but they don't do anything about it because they don't know what to do, so they keep doing the same thing to numb the pain that comes with change”– Dan Koe\n\n“Most people live a quietly anxious life because they know they should be doing something other than what they're doing, but they don't do anything about it because they don't know what to do, so they keep doing the same thing to numb the pain that comes with change”\n\n– Dan Koe\n\nWhen you act high agency you focus on execution and moving forward. This relieves a a lot of stress because you get glimmers of hope through the small daily progress.\n\nPsychologist Nick Wignall goes a step further:\n\n“One of the deep causes of chronic worry is that we use it as a defense mechanism against helplessness and perceived lack of control. Because worry feels productive, it gives us the illusion of control, which temporarily alleviates anxiety but increases it long-term.”\n\nHigh agency behavior helps you gain real control.\n\n# Being high agency is a refusal to accept the status quo\n\nThis dude emailed me today.\n\n“Elon’s X platform is going bankrupt and he’s losing his fortune. Join my program and I’ll teach you, Tim, how to find real financial success.”\n\nI laughed out loud.\n\nElon may be a schoolboy who makes d*ck jokes and has a personality I personally don’t resonate with, but he’s not going bankrupt. Quite the opposite. His net worth is exploding because his businesses cover self-driving cars, robots, AI, social media, renewable energy, and space travel.\n\nThis reader of mine is low agency because they’re stuck in the status quo of a year ago when mainstream media went on an Elon rampage. Temporarily it looked like there was trouble in paradise with Elon but it didn’t last.\n\nHe reversed the damage through relentless execution.\n\nHigh agency people are the opposite.\n\n* They have an open mind.\n* They can reverse course when the facts change.\n* They don’t hold onto opinions from years ago because it feels delicious and fits with some child-like view of politics.\n\nThey have an open mind.\n\nThey can reverse course when the facts change.\n\nThey don’t hold onto opinions from years ago because it feels delicious and fits with some child-like view of politics.\n\n# Being high agency makes you more likable\n\nHigh agency people are more likable because they have social proof.\n\nThey can show you evidence of their capability. They don’t rely on fake references, “featured in CNBC,” and letters after their name to do the talking for them.\n\nThis reality makes you more helpful. And we love helpful people. Being high agency makes you more confident, too, because you’ve got real achievements. That confidence shows up in how you act around others.\n\nThe confidence becomes charm… rather than arrogance and an inflated ego which is what the frustrated geniuses have.\n\n# Final Thought\n\nThe average person is low agency and lives like a machine. They get told what to do, feel unfulfilled, and are lost. This is no way to live.\n\nAdopt the high agency way of life and watch it change your life.\n\n---\n\nP.S. Next week, I'm announcing a brand new challenge, ideal for people who have (or want) high agency.\n\nThe goal: Creating a new revenue stream in just 1 weekend.\n\nWant early access?\n\nHit reply and tell me.",
  "word_count": 2188,
  "reading_time_minutes": 11
}