{
  "id": "you-must-master-the-art-of-unproductivity-if-you-want-to-be-successful-in-the-new-economy",
  "source": "tim_denning",
  "title": "You Must Master the Art of Unproductivity If You Want to Be Successful in the New Economy",
  "author": "Tim Denning",
  "date": null,
  "source_url": "https://timdenning.substack.com/p/you-must-master-the-art-of-unproductivity",
  "topics": [
    "Master",
    "Art",
    "Unproductivity",
    "Want",
    "Successful"
  ],
  "sections": [
    {
      "heading": "Main",
      "content": "# You Must Master the Art of Unproductivity If You Want to Be Successful in the New Economy\n\n### #6 – Practice forced solitude while smoking a fat corn cob pipe.\n\nShare\n\nThe productivity cult is about to die.\n\nFinally. Many of us have been praying to a fake god for this moment in history. It’s here. Happy dance. Yay.\n\nIn the old economy, it was all about productivity.\n\n* Hustle hard and work long hours\n* Use productivity apps\n* Attend lots of meetings\n* Consume endless amounts of information\n\nHustle hard and work long hours\n\nUse productivity apps\n\nAttend lots of meetings\n\nConsume endless amounts of information\n\nWhat’s changed is AI can now do hard work and meaningless admin at scale. Every day that passes, AI can do more of humans' bullsh*t work.\n\nFast forward two more years and humans won’t need to do many of the hard work activities we once did. It’s going to leave a strange void in the world. For once in humanity’s existence we’ll have a lot less to do.\n\nBefore you get excited, it doesn’t mean we’ll all be sitting on mobile recliners watching Netflix all day, as the animated movie Walle-E suggested. No.\n\nWhat it means is productivity will no longer f*cking matter.\n\nWhat will now matter is creativity.\n\nMusic, art, acting, painting, solving hard problems…. will go back to being the dominant forces that shape the world, the way they did during the Renaissance period hundreds of years ago.\n\nTo prepare for this creative revolution, you’ll need to master the art of unproductivity. Unlike productive habits, the ones that help you be more creative are uns*xy as hell.\n\nHere are the new habits you’ll need to master.\n\n# Walk like Socrates through nature as if it’s 350 BC\n\nThe modern workday sucks because it doesn’t include walking.\n\nYou wake up in a box. Eat from a box. Commute in a box to an office cubicle. And maybe drink a cylinder of Coke for lunch to change things up.\n\nWhen I started working for myself one thing that changed is I began to walk like a madman. I’d often turn meetings into walking meetings. I found not only did I feel better, but I was more creative. Walking in nature takes it a step further.\n\nThe greenery and fresh air help the mind unwind.\n\nDan Koe once said:\n\n> “Ancient Romans and Greeks, Steve Jobs, Charles Darwin, and an ever-growing list of visionaries, strategists, and innovators attribute their success to surprisingly low work times accompanied by an abundance of restful activities like long walks.”\n\n“Ancient Romans and Greeks, Steve Jobs, Charles Darwin, and an ever-growing list of visionaries, strategists, and innovators attribute their success to surprisingly low work times accompanied by an abundance of restful activities like long walks.”\n\nThe greats from the past didn’t work long hours, and going forward we won’t need to either. Walks are a perfect way to fill in the extra time, so when we are working we’re 10x more creative.\n\nOne thing that makes my walks more interesting is imagining that someone from 1000s of years ago walked the same steps that I’m walking right now. It lights a bonfire underneath my imagination and helps me come alive. Try it.\n\nTo unlock your creative superpower make sure to throw your headphones in a lake and walk in silence.\n\nI’m not saying going for a walk will solve all your problems, I’m just saying there’s no problem that’s going to be made worse by going for a walk – Ryan Holiday\n\n# Daydream in the middle of the day\n\nI once sat in the lobby of the bank I worked at daydreaming.\n\nThe next day my boss told me that a “Head of” thought I was slacking off and not talking to enough customers. What that dumbass didn’t realize is, while daydreaming, I thought of a way to onboard more tech companies to our bank using a referral partner.\n\nThis breakthrough would never have happened if I spent 12 hours a day only talking to customers and yelling “buy our bank accounts, sir, they’re the best. We’ll make you rich.”\n\nNew mental model:\n\nThere’s some sh*tty programming the corporate world infects you with – not being able to daydream is one example.\n\nAnother way to daydream is to go watch traffic on a freeway for 3 hours. The movement of the cars becomes like a free form of meditation. When we daydream we activate our imagination and escape the hell of our to-do list.\n\nI find spending time with my 1 year old daughter helps too.\n\nWe’re always imagining new games to play, and pretending regular household items are strange characters. The other day my daughter told me the broom was actually a horse that escaped from the enchanted forest. I’ll roll with that. Sounds plausible. The brush does kind of look like a horse’s mane if you think about it.\n\nWhat turns an adult back into a baby is a lack of imagination.\n\n(It’s the new pandem!c, by the way.)\n\nYou’re gonna need that old rusty imagination again if you want to survive the AI wars and still make money in this new economy. Start turning brooms into wild horses.\n\nThe creativity part doesn’t happen without the daydreaming. In my line of work, I need to daydream – Lin-Manuel (creator of the Hamilton Musical)\n\n# Write like Hemingway is your hero\n\nI shouldn’t admit this (and don’t tell my wife) but writing makes me h0rny.\n\nNot in a s*xual way, but in a way where writing forces my brain to come alive and join the dots between ideas.\n\nWriting is one of the best ways to be creative. Every artistic outlet can begin with writing.\n\n* A movie starts as writing.\n* A painting starts as words on a page.\n* A podcast starts with an email pitch to a guest.\n* A Youtube video starts as a written script (yes, Youtube is mostly all scripted).\n\nA movie starts as writing.\n\nA painting starts as words on a page.\n\nA podcast starts with an email pitch to a guest.\n\nA Youtube video starts as a written script (yes, Youtube is mostly all scripted).\n\nYour life will get better if you write every day. The next level is to write and publish on social media. This allows your ideas to become magnets for opportunities and humans that can elevate those ideas beyond your inner world.\n\nGroups gathering for the purpose of creativity are going to be crucial in the new economy. Let writing help you form the network needed.\n\nIf you’re thinking without writing, you only think you’re thinking — Leslie Lamport\n\n# Blow your ear drums out with this type of music\n\nModern music sucks.\n\nI used to be a DJ for 10 years. The rock of the 70s and 80s, or the pop of the 90s, or the house/dance music of the early 2000s is way better than the boring sh*t we have now from artists like Kendrik Lemar.\n\nThey put these stupid filters on their voice that make them sound like robots. I prefer to just listen to a human voice without all the robot sounds.\n\nI’ve been thinking about music a lot lately.\n\n* Is it that we’ve written every chord progression or melody in existence already and that’s why modern music sucks?\n* Is the technology making the music sound worse?\n* Is music not as exciting anymore in a dopamine-fuelled world where you can get bigger rushes of adrenaline from video games or p*rn?\n\nIs it that we’ve written every chord progression or melody in existence already and that’s why modern music sucks?\n\nIs the technology making the music sound worse?\n\nIs music not as exciting anymore in a dopamine-fuelled world where you can get bigger rushes of adrenaline from video games or p*rn?\n\nI’ve concluded it’s none of that. Music sucks because creativity is lacking.\n\nWe’re so busy working to cover the high cost of living that there’s not a lot of spare time to be creative.\n\nBetween news, politics, and social media our brains are fried. We’re trained to think the world is worse than it is, so after a while we don’t have the energy or optimism to sit down at a piano and make a beautiful piece of music inspired by a love affair.\n\nWe don’t even have as many love affairs anymore because going to a bar for a drink isn’t as convenient as texting a Tinder buddy (who soon, too, will be an AI bot). Why find love when you can make love to a s*x doll? Sounds odd, but that's where we’re heading.\n\nThe quality of music is a reflection of the quality of human consciousness.\n\nWe’re at rock bottom, especially right before the US election, but thankfully we’re on the cusp of good times and great classic hits again as creativity takes center stage once more.\n\nTo make better music and be more creative we still need music, though. I recommend movie soundtracks. Turn on a bit of Hans Zimmer during the day and watch it change your mood. You’ll feel inspired to create.\n\nIf you listen to songs on your phone sorted by when you added them, you are essentially going back in time. Songs trigger memories, wonderfully so! – Ankur Warikoo\n\n# Read and feel like you’re taking speed\n\nThe gurus on Twitter/X say reading is procrastination in disguise.\n\nThey say you need to have a goal in mind before you read any book, like everything is a f*cking self-help concert starring Tony Robbins on lead guitar, Jim Rohn on the drums, and Zig Ziglar rapping. Screw those illiterate morons on X.\n\nReading is incredible.\n\nOn the surface it’s unproductive. Below the surface it’s the source of better ideas and an expanded vocabulary.\n\nWhen your vocabulary expands you get better at explaining things. You become more articulate which makes you a better communicator. In a world of AI, you better hope your human communication skills are first-class.\n\nThe best way to choose a book to read is to follow your curiosity.\n\nI double dare you to piss off the productivity gurus and read a fiction book. That’ll really get ‘em raging and seeing red! (haha evil Denning)\n\nTo experience time travel, read. To achieve immortality, write – James Clear\n\n# Practice forced solitude while smoking a fat corn cob pipe\n\nLoners are the new elites.\n\nBeing unproductive often means being alone. The need to be around others all the time is often why people work office jobs. They can’t stand not to have office friends. I don’t say this as an insult. Nope.\n\nI worked in banking for 10 years longer than I should because I was lonely.\n\nSeeing Greg the concierge or Amelia the cleaner was the highlight of my day. We’d talk smack about lots of stuff, even topics I had no clue about (like AFL football).\n\nDisappearing to a wood cabin in a forest and smoking a corn cob pipe used to be the dream. Then people laughed at it. In this creative boom, it’s going to become the goal again.\n\nSuburban life has downsides. Where I live it’s a chorus of dogs barking 24/7. I may be home alone as I write this, but it feels like I’ve got 101 Dalmatians sitting next to me.\n\nWithout true solitude it’s hard to think deeply. It’s hard to uncover those big ideas we have stuck inside our s*xy brains. Start escaping to the woods now as a habit, so you can develop this skill in time for the creative boom.\n\nIt takes 4-6 weeks of uncomfortable isolation to create a new vision for yourself, and your life – Zach Pogrob\n\n# Be quieter than normal\n\nThe productivity age loves talking.\n\nGo into a productive workplace and you’ll see endless meetings full of people talking over the top of each other. People just keep talking because they want to feel like they’re #AddingValue or coming across as smart to their colleagues.\n\nTrue creative people are quieter than two ants having s*x.\n\nRecord producer Rick Rubin is one such example. The dude has a long beard and is famous for being quiet in front of the world’s biggest musicians. Or take actor Keanu Reeves (who I’m convinced is Jesus reincarnated).\n\nThe guy does these big-ass interviews and spends much of the time taking long pauses and looking up at the ceiling. I’ve found quiet people have smaller egos. This makes them more creative because our ego often stands in the way of our best ideas.\n\nListen more than you talk. Try saying nothing for the next 24 hours.\n\n> Quiet people have the loudest minds – Stephen Hawking\n\nQuiet people have the loudest minds – Stephen Hawking\n\n# Final Thought\n\nThe mind is your biggest asset. Without taking care of it, you’ll never be creative enough to thrive in the digital renaissance of the 2020s.\n\nGet used to feeling like you’re pissing your time down the toilet. Being unproductive is how you’ll increase your creativity, so you can outperform AI and carve a path in life that’ll lead you to personal freedom.\n\nTell me which of these unproductive ideas you loved the most and why in the comments.\n\n---\n\nP.S. Are you writing online?\n\nIf so, how's it going?\n\nTake my gut-check survey here."
    }
  ],
  "main_content": "# You Must Master the Art of Unproductivity If You Want to Be Successful in the New Economy\n\n### #6 – Practice forced solitude while smoking a fat corn cob pipe.\n\nShare\n\nThe productivity cult is about to die.\n\nFinally. Many of us have been praying to a fake god for this moment in history. It’s here. Happy dance. Yay.\n\nIn the old economy, it was all about productivity.\n\n* Hustle hard and work long hours\n* Use productivity apps\n* Attend lots of meetings\n* Consume endless amounts of information\n\nHustle hard and work long hours\n\nUse productivity apps\n\nAttend lots of meetings\n\nConsume endless amounts of information\n\nWhat’s changed is AI can now do hard work and meaningless admin at scale. Every day that passes, AI can do more of humans' bullsh*t work.\n\nFast forward two more years and humans won’t need to do many of the hard work activities we once did. It’s going to leave a strange void in the world. For once in humanity’s existence we’ll have a lot less to do.\n\nBefore you get excited, it doesn’t mean we’ll all be sitting on mobile recliners watching Netflix all day, as the animated movie Walle-E suggested. No.\n\nWhat it means is productivity will no longer f*cking matter.\n\nWhat will now matter is creativity.\n\nMusic, art, acting, painting, solving hard problems…. will go back to being the dominant forces that shape the world, the way they did during the Renaissance period hundreds of years ago.\n\nTo prepare for this creative revolution, you’ll need to master the art of unproductivity. Unlike productive habits, the ones that help you be more creative are uns*xy as hell.\n\nHere are the new habits you’ll need to master.\n\n# Walk like Socrates through nature as if it’s 350 BC\n\nThe modern workday sucks because it doesn’t include walking.\n\nYou wake up in a box. Eat from a box. Commute in a box to an office cubicle. And maybe drink a cylinder of Coke for lunch to change things up.\n\nWhen I started working for myself one thing that changed is I began to walk like a madman. I’d often turn meetings into walking meetings. I found not only did I feel better, but I was more creative. Walking in nature takes it a step further.\n\nThe greenery and fresh air help the mind unwind.\n\nDan Koe once said:\n\n> “Ancient Romans and Greeks, Steve Jobs, Charles Darwin, and an ever-growing list of visionaries, strategists, and innovators attribute their success to surprisingly low work times accompanied by an abundance of restful activities like long walks.”\n\n“Ancient Romans and Greeks, Steve Jobs, Charles Darwin, and an ever-growing list of visionaries, strategists, and innovators attribute their success to surprisingly low work times accompanied by an abundance of restful activities like long walks.”\n\nThe greats from the past didn’t work long hours, and going forward we won’t need to either. Walks are a perfect way to fill in the extra time, so when we are working we’re 10x more creative.\n\nOne thing that makes my walks more interesting is imagining that someone from 1000s of years ago walked the same steps that I’m walking right now. It lights a bonfire underneath my imagination and helps me come alive. Try it.\n\nTo unlock your creative superpower make sure to throw your headphones in a lake and walk in silence.\n\nI’m not saying going for a walk will solve all your problems, I’m just saying there’s no problem that’s going to be made worse by going for a walk – Ryan Holiday\n\n# Daydream in the middle of the day\n\nI once sat in the lobby of the bank I worked at daydreaming.\n\nThe next day my boss told me that a “Head of” thought I was slacking off and not talking to enough customers. What that dumbass didn’t realize is, while daydreaming, I thought of a way to onboard more tech companies to our bank using a referral partner.\n\nThis breakthrough would never have happened if I spent 12 hours a day only talking to customers and yelling “buy our bank accounts, sir, they’re the best. We’ll make you rich.”\n\nNew mental model:\n\nThere’s some sh*tty programming the corporate world infects you with – not being able to daydream is one example.\n\nAnother way to daydream is to go watch traffic on a freeway for 3 hours. The movement of the cars becomes like a free form of meditation. When we daydream we activate our imagination and escape the hell of our to-do list.\n\nI find spending time with my 1 year old daughter helps too.\n\nWe’re always imagining new games to play, and pretending regular household items are strange characters. The other day my daughter told me the broom was actually a horse that escaped from the enchanted forest. I’ll roll with that. Sounds plausible. The brush does kind of look like a horse’s mane if you think about it.\n\nWhat turns an adult back into a baby is a lack of imagination.\n\n(It’s the new pandem!c, by the way.)\n\nYou’re gonna need that old rusty imagination again if you want to survive the AI wars and still make money in this new economy. Start turning brooms into wild horses.\n\nThe creativity part doesn’t happen without the daydreaming. In my line of work, I need to daydream – Lin-Manuel (creator of the Hamilton Musical)\n\n# Write like Hemingway is your hero\n\nI shouldn’t admit this (and don’t tell my wife) but writing makes me h0rny.\n\nNot in a s*xual way, but in a way where writing forces my brain to come alive and join the dots between ideas.\n\nWriting is one of the best ways to be creative. Every artistic outlet can begin with writing.\n\n* A movie starts as writing.\n* A painting starts as words on a page.\n* A podcast starts with an email pitch to a guest.\n* A Youtube video starts as a written script (yes, Youtube is mostly all scripted).\n\nA movie starts as writing.\n\nA painting starts as words on a page.\n\nA podcast starts with an email pitch to a guest.\n\nA Youtube video starts as a written script (yes, Youtube is mostly all scripted).\n\nYour life will get better if you write every day. The next level is to write and publish on social media. This allows your ideas to become magnets for opportunities and humans that can elevate those ideas beyond your inner world.\n\nGroups gathering for the purpose of creativity are going to be crucial in the new economy. Let writing help you form the network needed.\n\nIf you’re thinking without writing, you only think you’re thinking — Leslie Lamport\n\n# Blow your ear drums out with this type of music\n\nModern music sucks.\n\nI used to be a DJ for 10 years. The rock of the 70s and 80s, or the pop of the 90s, or the house/dance music of the early 2000s is way better than the boring sh*t we have now from artists like Kendrik Lemar.\n\nThey put these stupid filters on their voice that make them sound like robots. I prefer to just listen to a human voice without all the robot sounds.\n\nI’ve been thinking about music a lot lately.\n\n* Is it that we’ve written every chord progression or melody in existence already and that’s why modern music sucks?\n* Is the technology making the music sound worse?\n* Is music not as exciting anymore in a dopamine-fuelled world where you can get bigger rushes of adrenaline from video games or p*rn?\n\nIs it that we’ve written every chord progression or melody in existence already and that’s why modern music sucks?\n\nIs the technology making the music sound worse?\n\nIs music not as exciting anymore in a dopamine-fuelled world where you can get bigger rushes of adrenaline from video games or p*rn?\n\nI’ve concluded it’s none of that. Music sucks because creativity is lacking.\n\nWe’re so busy working to cover the high cost of living that there’s not a lot of spare time to be creative.\n\nBetween news, politics, and social media our brains are fried. We’re trained to think the world is worse than it is, so after a while we don’t have the energy or optimism to sit down at a piano and make a beautiful piece of music inspired by a love affair.\n\nWe don’t even have as many love affairs anymore because going to a bar for a drink isn’t as convenient as texting a Tinder buddy (who soon, too, will be an AI bot). Why find love when you can make love to a s*x doll? Sounds odd, but that's where we’re heading.\n\nThe quality of music is a reflection of the quality of human consciousness.\n\nWe’re at rock bottom, especially right before the US election, but thankfully we’re on the cusp of good times and great classic hits again as creativity takes center stage once more.\n\nTo make better music and be more creative we still need music, though. I recommend movie soundtracks. Turn on a bit of Hans Zimmer during the day and watch it change your mood. You’ll feel inspired to create.\n\nIf you listen to songs on your phone sorted by when you added them, you are essentially going back in time. Songs trigger memories, wonderfully so! – Ankur Warikoo\n\n# Read and feel like you’re taking speed\n\nThe gurus on Twitter/X say reading is procrastination in disguise.\n\nThey say you need to have a goal in mind before you read any book, like everything is a f*cking self-help concert starring Tony Robbins on lead guitar, Jim Rohn on the drums, and Zig Ziglar rapping. Screw those illiterate morons on X.\n\nReading is incredible.\n\nOn the surface it’s unproductive. Below the surface it’s the source of better ideas and an expanded vocabulary.\n\nWhen your vocabulary expands you get better at explaining things. You become more articulate which makes you a better communicator. In a world of AI, you better hope your human communication skills are first-class.\n\nThe best way to choose a book to read is to follow your curiosity.\n\nI double dare you to piss off the productivity gurus and read a fiction book. That’ll really get ‘em raging and seeing red! (haha evil Denning)\n\nTo experience time travel, read. To achieve immortality, write – James Clear\n\n# Practice forced solitude while smoking a fat corn cob pipe\n\nLoners are the new elites.\n\nBeing unproductive often means being alone. The need to be around others all the time is often why people work office jobs. They can’t stand not to have office friends. I don’t say this as an insult. Nope.\n\nI worked in banking for 10 years longer than I should because I was lonely.\n\nSeeing Greg the concierge or Amelia the cleaner was the highlight of my day. We’d talk smack about lots of stuff, even topics I had no clue about (like AFL football).\n\nDisappearing to a wood cabin in a forest and smoking a corn cob pipe used to be the dream. Then people laughed at it. In this creative boom, it’s going to become the goal again.\n\nSuburban life has downsides. Where I live it’s a chorus of dogs barking 24/7. I may be home alone as I write this, but it feels like I’ve got 101 Dalmatians sitting next to me.\n\nWithout true solitude it’s hard to think deeply. It’s hard to uncover those big ideas we have stuck inside our s*xy brains. Start escaping to the woods now as a habit, so you can develop this skill in time for the creative boom.\n\nIt takes 4-6 weeks of uncomfortable isolation to create a new vision for yourself, and your life – Zach Pogrob\n\n# Be quieter than normal\n\nThe productivity age loves talking.\n\nGo into a productive workplace and you’ll see endless meetings full of people talking over the top of each other. People just keep talking because they want to feel like they’re #AddingValue or coming across as smart to their colleagues.\n\nTrue creative people are quieter than two ants having s*x.\n\nRecord producer Rick Rubin is one such example. The dude has a long beard and is famous for being quiet in front of the world’s biggest musicians. Or take actor Keanu Reeves (who I’m convinced is Jesus reincarnated).\n\nThe guy does these big-ass interviews and spends much of the time taking long pauses and looking up at the ceiling. I’ve found quiet people have smaller egos. This makes them more creative because our ego often stands in the way of our best ideas.\n\nListen more than you talk. Try saying nothing for the next 24 hours.\n\n> Quiet people have the loudest minds – Stephen Hawking\n\nQuiet people have the loudest minds – Stephen Hawking\n\n# Final Thought\n\nThe mind is your biggest asset. Without taking care of it, you’ll never be creative enough to thrive in the digital renaissance of the 2020s.\n\nGet used to feeling like you’re pissing your time down the toilet. Being unproductive is how you’ll increase your creativity, so you can outperform AI and carve a path in life that’ll lead you to personal freedom.\n\nTell me which of these unproductive ideas you loved the most and why in the comments.\n\n---\n\nP.S. Are you writing online?\n\nIf so, how's it going?\n\nTake my gut-check survey here.",
  "word_count": 2234,
  "reading_time_minutes": 11
}