{
  "id": "you-could-be-richbut-youre-chasing-passive-income",
  "source": "tim_denning",
  "title": "You could be rich...but you're chasing passive income.",
  "author": "Tim Denning",
  "date": null,
  "source_url": "https://timdenning.substack.com/p/you-could-be-richbut-youre-chasing",
  "topics": [
    "Richbut",
    "Chasing",
    "Passive",
    "Income"
  ],
  "sections": [
    {
      "heading": "Main",
      "content": "# You could be rich...but you're chasing passive income.\n\n### It'll force you to work harder than you need to.\n\nShare\n\nPassive income isn’t a scam.\n\nIt’s just misunderstood. Everyone wants to talk about how passive income is impossible and how you’ll never have it. I’m not going to do that.\n\nAfter spending 11 years and helping 6000+ people build online businesses, I’ve noticed a darker truth that’s rarely spoken about.\n\nIf your desire in life is to have passive income, there’s often a deeper reason why. The massive problem I’ve found with passive income is it can accidentally screw up how you see the world.\n\nAnd when you misunderstand what passive income is you automatically close off every path that exists to ever become wealthy.\n\nI’ve learned how to think about passive income, and it’s made me wealthy. It’s a life-changing concept that’ll transform how you work, live, and think about money.\n\n# This is why people desperately want passive income\n\nPeople are working harder and longer than ever before.\n\nSo it makes sense that we’re looking for an escape. A different way of life. Thanks to the internet and social media, passive income has become that escape.\n\nIf you’ve ever read a book about money, you’ve likely come across the author Robert Kiyosaki, who wrote Rich Dad, Poor Dad. Decades ago this book laid the foundation for the passive income nightmare that now exists. In the book, one simple idea is presented to readers.\n\n“Trading time for money is a bad idea. It’ll make you poor.”\n\nOn the surface this idea seems harmless. But it’s led to several generations of adults who don’t understand how money works. If you think trading time for money is the epitome of stupidity, well, you’ll do the opposite.\n\nAnd the opposite is to chase passive income.\n\nNow you know why most people online are desperately trying to find a way to get passive income. It created an entire era of info products that are now dead in a world reshaped by AI. But let’s break down why this is a problem.\n\nWhen you believe trading time for money is a bad idea, you’ll look for ways to earn a living that require you to hardly invest any time. Or worse, those that require you to invest no time at all. That little idea seems harmless.\n\nBut as you dissect it with people further, you realize what they’re really saying is “I want an easy way to make money.” Go back and forth with them on that idea, and you realize what they’re trying to avoid is doing any hard work.\n\nThis is the big problem.\n\nBecoming wealthy is hard work. The way to know if you’re infected with the passive income virus is if you find yourself saying:\n\n* “I want a system.”Translation: Give me a proven system that’s guaranteed to make me money on autopilot.\n* Translation: Give me a proven system that’s guaranteed to make me money on autopilot.\n* “I just want to write.”Translation: I will publish my words and people will eventually see I’m a genius in my field. Then they will pay to read what I write and a book publisher will give me a multi-million-dollar advance. The writing will pay me.\n* Translation: I will publish my words and people will eventually see I’m a genius in my field. Then they will pay to read what I write and a book publisher will give me a multi-million-dollar advance. The writing will pay me.\n* “I don’t want customers.”Translation: I want to sell one-time purchases. Build it once and sell it forever with no effort or marketing. Just build a funnel, you know.\n* Translation: I want to sell one-time purchases. Build it once and sell it forever with no effort or marketing. Just build a funnel, you know.\n* “I don’t want to deal with delivery.”Translation: I want to take people’s money then disappear right after that because customers are annoying and sales & marketing is beneath me.\n* Translation: I want to take people’s money then disappear right after that because customers are annoying and sales & marketing is beneath me.\n* “I want to only work during certain seasons of life.”Translation: I will be working for 3 months, but then at the end of the year I go on vacation, so this business needs to run itself. By the way, I’m having a kid so I won’t have time to deal with customers for 3, 6, or even 9 months.\n* Translation: I will be working for 3 months, but then at the end of the year I go on vacation, so this business needs to run itself. By the way, I’m having a kid so I won’t have time to deal with customers for 3, 6, or even 9 months.\n\n“I want a system.”\n\nTranslation: Give me a proven system that’s guaranteed to make me money on autopilot.\n\n“I just want to write.”\n\nTranslation: I will publish my words and people will eventually see I’m a genius in my field. Then they will pay to read what I write and a book publisher will give me a multi-million-dollar advance. The writing will pay me.\n\n“I don’t want customers.”\n\nTranslation: I want to sell one-time purchases. Build it once and sell it forever with no effort or marketing. Just build a funnel, you know.\n\n“I don’t want to deal with delivery.”\n\nTranslation: I want to take people’s money then disappear right after that because customers are annoying and sales & marketing is beneath me.\n\n“I want to only work during certain seasons of life.”\n\nTranslation: I will be working for 3 months, but then at the end of the year I go on vacation, so this business needs to run itself. By the way, I’m having a kid so I won’t have time to deal with customers for 3, 6, or even 9 months.\n\nIt’s all just, “I don’t want to work.” And not wanting to work has f*cked up entire generations of humans. All thanks to Rich Dad, Poor Dad.\n\nSetting up any genuine passive income stream is extremely hard work. I’ll give you a great example…\n\n# The nasty wake up call from multilevel marketing\n\nA good friend of mine, Dom, is a passive income badass.\n\nHe lives the dream. He barely works. He travels around the world 12 months of the year. He has some of the coolest cars you’ve ever seen. I’ve studied him for 10 years.\n\nWhy?\n\nBecause he made his passive income in the multilevel marketing industry working for one of the most well-known players in the space. It’s the toughest form of passive income to crack. You have to sell a known pyramid scheme to complete strangers.\n\nAs soon as people hear the name of the pyramid scheme, 75% of them will instantly recognize it and opt out. They’re the most well-known pyramid scheme in the world. You sell products then recruit others to sell products.\n\nOnly the top 0.1% in MLM live the passive income dream life. Dom is one of them.\n\nHe spends his days going around giving speeches to the other resellers. Showing them his lifestyle and how they can do it too. He’s charismatic and insanely honest because of his deep religious beliefs.\n\nDom has massive passive income.\n\nWhat’s missed is how he got it. When Dom was born his mother and father got the opportunity to be one of the first resellers of this MLM in Australia. Over several decades they became the largest reseller. When Dom turned 18 he set up his own pyramid inside the same MLM. His parents taught him everything.\n\nThat could be the end of the story right there. It’s not.\n\nDom’s dad was a freaking hard ass. He didn’t want his son having the easy life. So Dom had to start his MLM business from nothing.\n\nI knew Dom back in those days. He hustled harder than anyone you’ve ever seen. He would sit in cafes all over Melbourne doing back-to-back coffee meetings. It went like this.\n\nBuild some rapport. Find out if the person wants another income stream. Draw the passive income MLM system on the back of a cafe napkin. Ask if they want to join. Have 95% of people say no.\n\nDom did this for more than 10 years. Every day. I’ve never seen anyone work so hard in my life. It consumed every hour of his day. He did it 7 days a week. After all that time Dom eventually earned himself passive income status.\n\nI’d argue that the path Dom took to get passive income is actually harder than the path of building a real business you 100% own that isn’t built on passive income.\n\nThe problem with passive income stories like Dom is one key fact is left out:\n\nTo earn passive income you must work extremely hard for many years to set it up. And even if you do reach passive income status, most models require hard work to keep them going. There is no “set and forget” income except…\n\n# The truth about passive income nobody told you\n\nThis comes directly from Gary Vee.\n\nIn a viral video, an audience member asks Gary how to set up passive income. He says what every wealthy person already knows. The only true passive income is:\n\n1. Investing in stocks\n2. Owning real estate\n\nInvesting in stocks\n\nOwning real estate\n\nBoth of these models require enormous upfront money. They both contain a lot of risk. And they’re deceptively complex below the surface.\n\nFinance guru Dave Ramsey, who I deeply disagree with most of the time, goes a step further. He says, being a landlord is NOT “Passive” Income.”\n\nFor once I agree with him.\n\nIf you’ve ever owned real estate you know it’s not passive at all. If you’ve ever had to manage renters, you also know that isn’t passive either. It’s hard work. Properties need maintenance and renovations. There’s inherent risk in economic downturns. Rent rarely covers the mortgage.\n\nThen there’s the naughty secret I’m not supposed to share: most people never make any money in real estate because they’re not experienced enough to know exactly what real estate to buy. Only sophisticated, data-backed investors know how.\n\nI personally love owning financial assets that make passive income. And I’ve been doing that for years. The difference is I don’t live off that passive income and I know it could all drop 50% tomorrow if a recession hits.\n\nThe lie gets worse.\n\nSince crypto went mainstream in 2021 there are now 1000s of new investments that claim to have passive income and will quietly scam you for every dollar you have.\n\nOne of the biggest risks you can take in life is to bet on passive income.\n\n# I’m partly to blame. Sorry.\n\nIt’s time to fling poo at me.\n\nHere’s the vulnerable part I’m not supposed to admit: I helped create this passive income problem. One of the first businesses I owned with my brother was vending machines.\n\nWe’d place chip and Coke machines all over Australia. Once the machine was in place we’d collect passive income. We ended up with 100s of these vending machines.\n\nBut the wheels started to fall off.\n\nWe needed 24/7 maintenance on the machines that were constantly breaking down. The replacement parts would destroy all of our profit. And the parts came from overseas so the machines would sit idle for weeks or even months waiting for parts.\n\nWe had to finance each machine which meant we had debt and interest to pay. Finding good places to put the machines was a full-time job. Even once we secured a site we had to do a revenue share with the owner. Then often we had to keep moving the location of each machine. That took time and expensive removalists to do so.\n\nWe eventually cracked the code. We would find places to put vending machines, sign the contract, install the machine, then sell it as a passive income dream. This was incredibly lucrative. One vending site we sold for $250,000 multiple times.\n\nLater in life, I rose to the top of Medium dot com. I made millions of dollars in passive income on the site by writing articles. The dollars looked easy to earn but I was writing full-time most days. 1000s of writers wanted to copy me not knowing that..\n\n1. I worked long hours\n2. The passive income model on the site was unsustainable.\n\nI worked long hours\n\nThe passive income model on the site was unsustainable.\n\nEventually, the site collapsed and the CEO admitted they were losing $2M USD a month. Their competitors all faced financial ruin for similar reasons.\n\nThen I sold millions of dollars a year in digital products and courses. Again, I became everyone’s favorite passive income hero until AI came along and this business model quickly started to die out.\n\nSo I left it behind.\n\nWhile I’ve become the poster boy for passive income, what’s missed is I was the exception to the rule. The statistical odds of anyone repeating that process are low. And the old passive income models are dying as AI drives efficiency across every business model in existence.\n\n# Chasing passive income will force you to work harder than you need to\n\nWait, what?!\n\nBecause 99% of passive income opportunities are bullsh*t, you’ll get scammed more times than a Nigerian prince. It’ll cost you a lot of money and time to learn these passive income business models that don’t work.\n\nIt’s not easy to jump from one passive income model to the next.\n\nFirst, it’ll be eCommerce dropshipping. Then it’ll be affiliate marketing products. Then selling books on Amazon on auto-pilot while wearing your nightgown 24/7. Next comes the Airbnb MLM of owning lots of properties and renting them out to holiday goers. After that comes a 7-figure passive income newsletter. If you’re unlucky, you may even do some day trading of stocks or crypto and really get smacked around.\n\nAll of this steals away years of your life.\n\nNone of it leads anywhere. And the passive income skills aren’t transferable to new opportunities. Making passive income in big amounts is so damn hard, it’ll consume your entire life. Why? Because it’s the lottery.\n\nTrying to win the lottery is extremely hard.\n\nBuilding a real business is actually much easier.\n\nYou’ll still work hard for at least a few years, but the outcomes are proven and statistically easier to reach. You can later hire people to do the hard work for you, and get the same life all these passive income fools are chasing.\n\n# Don’t be driven by fantasies\n\nThis is a big idea.\n\nThe danger of passive income – if you’re not careful – is you can end up chasing fantasies. Or relying on opportunities that have a 0.00001% chance of succeeding. This is a terrible way to live. How do I know?\n\nI spent my 20s living this way. It led to dark mental illness.\n\nI escaped by realizing that it’s better to just build a real business and chase opportunities that have a reasonable chance of success.\n\nLet’s go deeper.\n\nLet’s say the fantasy of passive income comes true. Where does it lead? Well, you sit around and do nothing each day. You hang out with family. You sit by the beach. You sip margaritas. This would be fun for a few weeks.\n\nBut if you know anyone, like I do, who’s lived this life, they’ll tell you it gets real boring real fast.\n\nOver time you realize your friends and family have work to do and people to see. And your passive income life starts to lead to an existential meaning crisis. I’ve even seen some people take their lives because of it.\n\nPassive income equals being bored all day.\n\nFor most people that’s not a fun life. Working hard to build something and earn money is fun. It’s good for you. It gives your life meaning. It makes you fulfilled.\n\nPart of the mental health crisis we’re living through right now is due to too many people falling for fantasies and ending up with a life of no meaning.\n\nWe live in the “fantasy economy” – and it’s making us fat, sick, and nearly dead.\n\n# Passive income likely won’t become a full-time income\n\nNo one tells you that.\n\nPassive income isn’t evil. I have it. You may have it. But the expectation it’s going to become a full-time income or make you a millionaire is what ruins many people’s lives. See passive income as a nice-to-have. Enjoy it. But don’t bank on it.\n\nMy approach to passive income is I have a 10+ year strategy in place to replace some of my earnings with passive income. That keeps me sane. And if it doesn’t work out, it doesn’t matter.\n\n# What this all means for you\n\nPassive income is a form of heroin.\n\nIf you get seduced by it, you’ll likely give up on the idea of hard work and chase an easy version of life that doesn’t exist and lacks meaning. Instead, choose a form of work that doesn’t feel like work that you like working hard at.\n\nAim to have a little passive income later in the journey, not in 30 days. Chase meaning instead of fantasies. Get excited by opportunities that have a statistical chance of becoming a reality. Expect to exchange your time for money in the beginning.\n\nAnd most of all…\n\nDo not let the passive income virus destroy your mindset and make you chase fantasies. Fall in love with hard. Ignore easy.\n\nYou’ll become rich if you don’t chase passive income.\n\nIf passive income isn’t the answer, why does the fantasy keep winning?\n\n---\n\nP.S. If you’re ready to ditch the fake passive income fantasy and build a real digital business...\n\nIt’s time to join Fearless Money Makers\n\nIn fact, it’s your last chance this year.\n\nIn Fearless Money Makers, we help you:\n\n* Start or scale your digital business\n* Work fewer hours each day & keep 90% profit margins\n* Achieve true financial & personal independence\n\nStart or scale your digital business\n\nWork fewer hours each day & keep 90% profit margins\n\nAchieve true financial & personal independence\n\nThe only “catch.”\n\nYou have to apply.\n\n(I figure if you can’t take 2 minutes to fill out the application, you won’t have the attention span to scale a digital business anyway.)\n\nHere’s the link to fill out the application now"
    }
  ],
  "main_content": "# You could be rich...but you're chasing passive income.\n\n### It'll force you to work harder than you need to.\n\nShare\n\nPassive income isn’t a scam.\n\nIt’s just misunderstood. Everyone wants to talk about how passive income is impossible and how you’ll never have it. I’m not going to do that.\n\nAfter spending 11 years and helping 6000+ people build online businesses, I’ve noticed a darker truth that’s rarely spoken about.\n\nIf your desire in life is to have passive income, there’s often a deeper reason why. The massive problem I’ve found with passive income is it can accidentally screw up how you see the world.\n\nAnd when you misunderstand what passive income is you automatically close off every path that exists to ever become wealthy.\n\nI’ve learned how to think about passive income, and it’s made me wealthy. It’s a life-changing concept that’ll transform how you work, live, and think about money.\n\n# This is why people desperately want passive income\n\nPeople are working harder and longer than ever before.\n\nSo it makes sense that we’re looking for an escape. A different way of life. Thanks to the internet and social media, passive income has become that escape.\n\nIf you’ve ever read a book about money, you’ve likely come across the author Robert Kiyosaki, who wrote Rich Dad, Poor Dad. Decades ago this book laid the foundation for the passive income nightmare that now exists. In the book, one simple idea is presented to readers.\n\n“Trading time for money is a bad idea. It’ll make you poor.”\n\nOn the surface this idea seems harmless. But it’s led to several generations of adults who don’t understand how money works. If you think trading time for money is the epitome of stupidity, well, you’ll do the opposite.\n\nAnd the opposite is to chase passive income.\n\nNow you know why most people online are desperately trying to find a way to get passive income. It created an entire era of info products that are now dead in a world reshaped by AI. But let’s break down why this is a problem.\n\nWhen you believe trading time for money is a bad idea, you’ll look for ways to earn a living that require you to hardly invest any time. Or worse, those that require you to invest no time at all. That little idea seems harmless.\n\nBut as you dissect it with people further, you realize what they’re really saying is “I want an easy way to make money.” Go back and forth with them on that idea, and you realize what they’re trying to avoid is doing any hard work.\n\nThis is the big problem.\n\nBecoming wealthy is hard work. The way to know if you’re infected with the passive income virus is if you find yourself saying:\n\n* “I want a system.”Translation: Give me a proven system that’s guaranteed to make me money on autopilot.\n* Translation: Give me a proven system that’s guaranteed to make me money on autopilot.\n* “I just want to write.”Translation: I will publish my words and people will eventually see I’m a genius in my field. Then they will pay to read what I write and a book publisher will give me a multi-million-dollar advance. The writing will pay me.\n* Translation: I will publish my words and people will eventually see I’m a genius in my field. Then they will pay to read what I write and a book publisher will give me a multi-million-dollar advance. The writing will pay me.\n* “I don’t want customers.”Translation: I want to sell one-time purchases. Build it once and sell it forever with no effort or marketing. Just build a funnel, you know.\n* Translation: I want to sell one-time purchases. Build it once and sell it forever with no effort or marketing. Just build a funnel, you know.\n* “I don’t want to deal with delivery.”Translation: I want to take people’s money then disappear right after that because customers are annoying and sales & marketing is beneath me.\n* Translation: I want to take people’s money then disappear right after that because customers are annoying and sales & marketing is beneath me.\n* “I want to only work during certain seasons of life.”Translation: I will be working for 3 months, but then at the end of the year I go on vacation, so this business needs to run itself. By the way, I’m having a kid so I won’t have time to deal with customers for 3, 6, or even 9 months.\n* Translation: I will be working for 3 months, but then at the end of the year I go on vacation, so this business needs to run itself. By the way, I’m having a kid so I won’t have time to deal with customers for 3, 6, or even 9 months.\n\n“I want a system.”\n\nTranslation: Give me a proven system that’s guaranteed to make me money on autopilot.\n\n“I just want to write.”\n\nTranslation: I will publish my words and people will eventually see I’m a genius in my field. Then they will pay to read what I write and a book publisher will give me a multi-million-dollar advance. The writing will pay me.\n\n“I don’t want customers.”\n\nTranslation: I want to sell one-time purchases. Build it once and sell it forever with no effort or marketing. Just build a funnel, you know.\n\n“I don’t want to deal with delivery.”\n\nTranslation: I want to take people’s money then disappear right after that because customers are annoying and sales & marketing is beneath me.\n\n“I want to only work during certain seasons of life.”\n\nTranslation: I will be working for 3 months, but then at the end of the year I go on vacation, so this business needs to run itself. By the way, I’m having a kid so I won’t have time to deal with customers for 3, 6, or even 9 months.\n\nIt’s all just, “I don’t want to work.” And not wanting to work has f*cked up entire generations of humans. All thanks to Rich Dad, Poor Dad.\n\nSetting up any genuine passive income stream is extremely hard work. I’ll give you a great example…\n\n# The nasty wake up call from multilevel marketing\n\nA good friend of mine, Dom, is a passive income badass.\n\nHe lives the dream. He barely works. He travels around the world 12 months of the year. He has some of the coolest cars you’ve ever seen. I’ve studied him for 10 years.\n\nWhy?\n\nBecause he made his passive income in the multilevel marketing industry working for one of the most well-known players in the space. It’s the toughest form of passive income to crack. You have to sell a known pyramid scheme to complete strangers.\n\nAs soon as people hear the name of the pyramid scheme, 75% of them will instantly recognize it and opt out. They’re the most well-known pyramid scheme in the world. You sell products then recruit others to sell products.\n\nOnly the top 0.1% in MLM live the passive income dream life. Dom is one of them.\n\nHe spends his days going around giving speeches to the other resellers. Showing them his lifestyle and how they can do it too. He’s charismatic and insanely honest because of his deep religious beliefs.\n\nDom has massive passive income.\n\nWhat’s missed is how he got it. When Dom was born his mother and father got the opportunity to be one of the first resellers of this MLM in Australia. Over several decades they became the largest reseller. When Dom turned 18 he set up his own pyramid inside the same MLM. His parents taught him everything.\n\nThat could be the end of the story right there. It’s not.\n\nDom’s dad was a freaking hard ass. He didn’t want his son having the easy life. So Dom had to start his MLM business from nothing.\n\nI knew Dom back in those days. He hustled harder than anyone you’ve ever seen. He would sit in cafes all over Melbourne doing back-to-back coffee meetings. It went like this.\n\nBuild some rapport. Find out if the person wants another income stream. Draw the passive income MLM system on the back of a cafe napkin. Ask if they want to join. Have 95% of people say no.\n\nDom did this for more than 10 years. Every day. I’ve never seen anyone work so hard in my life. It consumed every hour of his day. He did it 7 days a week. After all that time Dom eventually earned himself passive income status.\n\nI’d argue that the path Dom took to get passive income is actually harder than the path of building a real business you 100% own that isn’t built on passive income.\n\nThe problem with passive income stories like Dom is one key fact is left out:\n\nTo earn passive income you must work extremely hard for many years to set it up. And even if you do reach passive income status, most models require hard work to keep them going. There is no “set and forget” income except…\n\n# The truth about passive income nobody told you\n\nThis comes directly from Gary Vee.\n\nIn a viral video, an audience member asks Gary how to set up passive income. He says what every wealthy person already knows. The only true passive income is:\n\n1. Investing in stocks\n2. Owning real estate\n\nInvesting in stocks\n\nOwning real estate\n\nBoth of these models require enormous upfront money. They both contain a lot of risk. And they’re deceptively complex below the surface.\n\nFinance guru Dave Ramsey, who I deeply disagree with most of the time, goes a step further. He says, being a landlord is NOT “Passive” Income.”\n\nFor once I agree with him.\n\nIf you’ve ever owned real estate you know it’s not passive at all. If you’ve ever had to manage renters, you also know that isn’t passive either. It’s hard work. Properties need maintenance and renovations. There’s inherent risk in economic downturns. Rent rarely covers the mortgage.\n\nThen there’s the naughty secret I’m not supposed to share: most people never make any money in real estate because they’re not experienced enough to know exactly what real estate to buy. Only sophisticated, data-backed investors know how.\n\nI personally love owning financial assets that make passive income. And I’ve been doing that for years. The difference is I don’t live off that passive income and I know it could all drop 50% tomorrow if a recession hits.\n\nThe lie gets worse.\n\nSince crypto went mainstream in 2021 there are now 1000s of new investments that claim to have passive income and will quietly scam you for every dollar you have.\n\nOne of the biggest risks you can take in life is to bet on passive income.\n\n# I’m partly to blame. Sorry.\n\nIt’s time to fling poo at me.\n\nHere’s the vulnerable part I’m not supposed to admit: I helped create this passive income problem. One of the first businesses I owned with my brother was vending machines.\n\nWe’d place chip and Coke machines all over Australia. Once the machine was in place we’d collect passive income. We ended up with 100s of these vending machines.\n\nBut the wheels started to fall off.\n\nWe needed 24/7 maintenance on the machines that were constantly breaking down. The replacement parts would destroy all of our profit. And the parts came from overseas so the machines would sit idle for weeks or even months waiting for parts.\n\nWe had to finance each machine which meant we had debt and interest to pay. Finding good places to put the machines was a full-time job. Even once we secured a site we had to do a revenue share with the owner. Then often we had to keep moving the location of each machine. That took time and expensive removalists to do so.\n\nWe eventually cracked the code. We would find places to put vending machines, sign the contract, install the machine, then sell it as a passive income dream. This was incredibly lucrative. One vending site we sold for $250,000 multiple times.\n\nLater in life, I rose to the top of Medium dot com. I made millions of dollars in passive income on the site by writing articles. The dollars looked easy to earn but I was writing full-time most days. 1000s of writers wanted to copy me not knowing that..\n\n1. I worked long hours\n2. The passive income model on the site was unsustainable.\n\nI worked long hours\n\nThe passive income model on the site was unsustainable.\n\nEventually, the site collapsed and the CEO admitted they were losing $2M USD a month. Their competitors all faced financial ruin for similar reasons.\n\nThen I sold millions of dollars a year in digital products and courses. Again, I became everyone’s favorite passive income hero until AI came along and this business model quickly started to die out.\n\nSo I left it behind.\n\nWhile I’ve become the poster boy for passive income, what’s missed is I was the exception to the rule. The statistical odds of anyone repeating that process are low. And the old passive income models are dying as AI drives efficiency across every business model in existence.\n\n# Chasing passive income will force you to work harder than you need to\n\nWait, what?!\n\nBecause 99% of passive income opportunities are bullsh*t, you’ll get scammed more times than a Nigerian prince. It’ll cost you a lot of money and time to learn these passive income business models that don’t work.\n\nIt’s not easy to jump from one passive income model to the next.\n\nFirst, it’ll be eCommerce dropshipping. Then it’ll be affiliate marketing products. Then selling books on Amazon on auto-pilot while wearing your nightgown 24/7. Next comes the Airbnb MLM of owning lots of properties and renting them out to holiday goers. After that comes a 7-figure passive income newsletter. If you’re unlucky, you may even do some day trading of stocks or crypto and really get smacked around.\n\nAll of this steals away years of your life.\n\nNone of it leads anywhere. And the passive income skills aren’t transferable to new opportunities. Making passive income in big amounts is so damn hard, it’ll consume your entire life. Why? Because it’s the lottery.\n\nTrying to win the lottery is extremely hard.\n\nBuilding a real business is actually much easier.\n\nYou’ll still work hard for at least a few years, but the outcomes are proven and statistically easier to reach. You can later hire people to do the hard work for you, and get the same life all these passive income fools are chasing.\n\n# Don’t be driven by fantasies\n\nThis is a big idea.\n\nThe danger of passive income – if you’re not careful – is you can end up chasing fantasies. Or relying on opportunities that have a 0.00001% chance of succeeding. This is a terrible way to live. How do I know?\n\nI spent my 20s living this way. It led to dark mental illness.\n\nI escaped by realizing that it’s better to just build a real business and chase opportunities that have a reasonable chance of success.\n\nLet’s go deeper.\n\nLet’s say the fantasy of passive income comes true. Where does it lead? Well, you sit around and do nothing each day. You hang out with family. You sit by the beach. You sip margaritas. This would be fun for a few weeks.\n\nBut if you know anyone, like I do, who’s lived this life, they’ll tell you it gets real boring real fast.\n\nOver time you realize your friends and family have work to do and people to see. And your passive income life starts to lead to an existential meaning crisis. I’ve even seen some people take their lives because of it.\n\nPassive income equals being bored all day.\n\nFor most people that’s not a fun life. Working hard to build something and earn money is fun. It’s good for you. It gives your life meaning. It makes you fulfilled.\n\nPart of the mental health crisis we’re living through right now is due to too many people falling for fantasies and ending up with a life of no meaning.\n\nWe live in the “fantasy economy” – and it’s making us fat, sick, and nearly dead.\n\n# Passive income likely won’t become a full-time income\n\nNo one tells you that.\n\nPassive income isn’t evil. I have it. You may have it. But the expectation it’s going to become a full-time income or make you a millionaire is what ruins many people’s lives. See passive income as a nice-to-have. Enjoy it. But don’t bank on it.\n\nMy approach to passive income is I have a 10+ year strategy in place to replace some of my earnings with passive income. That keeps me sane. And if it doesn’t work out, it doesn’t matter.\n\n# What this all means for you\n\nPassive income is a form of heroin.\n\nIf you get seduced by it, you’ll likely give up on the idea of hard work and chase an easy version of life that doesn’t exist and lacks meaning. Instead, choose a form of work that doesn’t feel like work that you like working hard at.\n\nAim to have a little passive income later in the journey, not in 30 days. Chase meaning instead of fantasies. Get excited by opportunities that have a statistical chance of becoming a reality. Expect to exchange your time for money in the beginning.\n\nAnd most of all…\n\nDo not let the passive income virus destroy your mindset and make you chase fantasies. Fall in love with hard. Ignore easy.\n\nYou’ll become rich if you don’t chase passive income.\n\nIf passive income isn’t the answer, why does the fantasy keep winning?\n\n---\n\nP.S. If you’re ready to ditch the fake passive income fantasy and build a real digital business...\n\nIt’s time to join Fearless Money Makers\n\nIn fact, it’s your last chance this year.\n\nIn Fearless Money Makers, we help you:\n\n* Start or scale your digital business\n* Work fewer hours each day & keep 90% profit margins\n* Achieve true financial & personal independence\n\nStart or scale your digital business\n\nWork fewer hours each day & keep 90% profit margins\n\nAchieve true financial & personal independence\n\nThe only “catch.”\n\nYou have to apply.\n\n(I figure if you can’t take 2 minutes to fill out the application, you won’t have the attention span to scale a digital business anyway.)\n\nHere’s the link to fill out the application now",
  "word_count": 3100,
  "reading_time_minutes": 16
}