{
  "id": "linkedin_26",
  "source": "linkedin",
  "author": "Ruben Hassid",
  "author_username": "ruben-hassid",
  "author_headline": "Master AI before it masters you.",
  "date": "2025-05-26",
  "profile_url": "https://www.linkedin.com/in/ruben-hassid?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACTqmSEBqjBKksN0HBAs4iOYD-4FG5tf6hw",
  "text": "You can’t search without using AI.\n\nHere’s the best way to do it (in May 2025):\n\n☑ ChatGPT + o3 + search\n\n→ This is my favorite way of searching.\n→ o3 is the smartest model (not o4-mini).\n→ Truly behaves like an agent scrolling the web.\n\nPrompt to try:\n\n“Act as a B2B SaaS growth strategist. Think step-by-step: 1) grab the 10 best articles on buyer psychology 2) cluster their learnings into three themes; 3) craft one copy angle per theme that sells a $49 HR upskilling course. After thinking, output a single 70-word post that blends the strongest angle with a CTA—no emojis, no fluff.” \n\n____\n\n☑ Grok + DeeperSearch\n\n→ Grok is the ChatGPT of X (Twitter).\n→ It’s free to use, but gets better with a paid plan.\n→ The “DeeperSearch” mode is awesome for news.\n\nPrompt to try:\n\n“Example Q: ‘Top AI-policy headline today?’ Example A: ‘☑ EU weighs export caps on frontier models ’. Now—using DeeperSearch—write exactly 30 fresh X posts (≤130 chars each, start with ☑) on the biggest AI-founder moves announced today.” \n\n____\n\n☑ Perplexity + Research\n\n→ Perplexity was the AI of search.\n→ You can select your model once you pay.\n→ The “Research” mode creates full reports.\n\nPrompt to try:\n\n“Begin as a skeptical angel investor reviewing 2025 funnel-conversion data on $7 tripwire offers; list three red-flag metrics with live sources. Then switch voice to a CRO-obsessed growth lead; for every red flag propose one AI-driven fix projected to lift CVR ≥20%. Footnote every data point with link references.” \n\n____ \n\n☑ ChatGPT + Deep Research\n\n→ The most complete “Deep” search.\n→ Create a 10-20 page report on anything.\n→ It takes a couple of minutes to complete though.\n\nPrompt to try:\n\n“Act as a private-equity analyst. Produce a 15-page diligence report on the total addressable market, growth drivers, competitive moats, and acquisition multiples for AI-powered LinkedIn-content tools aimed at SMBs. Use APA citations and close with a one-page investment memo summarizing risk-reward in plain English.”\n\n____\n\nReshare ♻️  this image to help others search better.\n\nFollow Ruben Hassid to overcome your FOMO of AI.",
  "word_count": 356,
  "metrics": {
    "total_reactions": 2810,
    "likes": 1970,
    "love": 56,
    "insight": 87,
    "celebrate": 21,
    "support": 7,
    "funny": 669,
    "comments": 333,
    "reposts": 94
  }
}