{
  "id": "youre_still_typing_with_your_fingers",
  "source": "linkedin",
  "author_username": "ruben-hassid",
  "date": "2025-12-03",
  "profile_url": "https://www.linkedin.com/in/ruben-hassid?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACTqmSEBqjBKksN0HBAs4iOYD-4FG5tf6hw",
  "text": "You're still typing with your fingers.\n\nBut this AI just replaced my keyboard:\n\nThis is Wispr Flow. No credit card needed to try.\n\nYou'll never sound as natural as when you're talking with your voice. This is literally my best hack. \n\nAnd I don't even have to change my writing tools: this AI is on my Linkedin, Slack, WhatsApp...\n\nI just have a keystroke to type to touch, and then I can talk. I can even whisper in my office, and my colleague wouldn't hear it.\n\nThe magic behind Wispr Flow is how close to perfection the voice-to-text translation is.\n\nAnd if, for some reason, it is not perfect, let's say I'm saying my name, which is quite specific (like Ruben or the name of a client), well, as soon as I correct it, then Wispr Flow adds it to its dictionary.\n\nThe AI remembers & will never make the mistake.\n\nAnd if you're wondering how fast this is to talk instead of typing, this is on average 4 times faster. \n\nActually, I did the test, and I'm typing at 145 words per minute, which is considered a professional typing speed. I could sign up for contests.\n\nSo not only will you sound more natural, you will write more effectively, you'll be much faster, and to be honest, I'm at the stage where typing on a keyboard just feels weird now. \n\nI'm proud to be a partner of Wispr Flow. \n\nIt's part of the free AI tools once you sign up to my paid newsletter, alongside Gamma EasyGen & Blink. \n\nIt's one of those tools like ChatGPT that the first time you try it, you remember it, and sometimes you wonder how you used to live without them before. \n\nI wrote an entire guide - for free - on how I use Wispr Flow on a day-to-day. And how I made this very post you are reading right now.\n\nAccess it here: https://lnkd.in/dErvnp53.",
  "word_count": 323,
  "metrics": {
    "total_reactions": 616,
    "likes": 512,
    "love": 51,
    "insight": 20,
    "celebrate": 25,
    "support": 7,
    "funny": 1,
    "comments": 354,
    "reposts": 36
  }
}