{
  "id": "breaking_google_released_a_professional_headshot_prompting_g",
  "source": "linkedin",
  "author_username": "ruben-hassid",
  "date": "2025-10-06",
  "profile_url": "https://www.linkedin.com/in/ruben-hassid?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACTqmSEBqjBKksN0HBAs4iOYD-4FG5tf6hw",
  "text": "BREAKING: Google released a professional headshot prompting guide.\n\n1. Take a clear photo of yourself.\n2. Upload it on Gemini.\n3. Copy & paste the following prompt:\n4. I wrote a (free) nano banana prompting guide.\n5. Go to this blog: https://lnkd.in/d7xW8Qze\n____\n\nPrompt: \"A professional, high-resolution, profile photo, maintaining the exact facial structure, identity, and key features of the person in the input image. The subject is framed from the chest up, with ample headroom and negative space above their head, ensuring the top of their head is not cropped. The person looks directly at the camera, and the subject's body is also directly facing the camera. They are styled for a professional photo studio shoot, wearing a smart casual blazer. The background is a solid '# 141414' neutral studio. Shot from a high angle with bright and airy soft, diffused studio lighting, gently illuminating the face and creating a subtle catchlight in the eyes, conveying a sense of clarity. Captured on an 85mm f/1.8 lens with a shallow depth of field, exquisite focus on the eyes, and beautiful, soft bokeh. Observe crisp detail on the fabric texture of the blazer, individual strands of hair, and natural, realistic skin texture. The atmosphere exudes confidence, professionalism, and approachability. Clean and bright cinematic color grading with subtle warmth and balanced tones, ensuring a polished and contemporary feel.\"\n\ntl;dr:\n✦ Lighting is everything. \n✦ Get your angle right. \n✦ Dress for the job you want. \n✦ Use a solid, neutral studio background. \n\nHelp others create better headshots by \n\nPS: Ruben writes a newsletter to 131,000+ readers.\nJoin us for free at how-to-ai.guide.",
  "word_count": 270,
  "metrics": {
    "total_reactions": 2429,
    "likes": 2034,
    "love": 128,
    "insight": 178,
    "celebrate": 66,
    "support": 22,
    "funny": 1,
    "comments": 329,
    "reposts": 244
  },
  "hook_type": "breaking_news"
}