{
  "id": "you_dont_know_how_to_linkedin",
  "source": "linkedin",
  "author_username": "ruben-hassid",
  "date": "2025-08-11",
  "profile_url": "https://www.linkedin.com/in/ruben-hassid?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACTqmSEBqjBKksN0HBAs4iOYD-4FG5tf6hw",
  "text": "You don't know how to Linkedin.\n\nBut ChatGPT knows it & analyzes it for you:\n\n1. Download your profile as a PDF\n\n✦ Click on your Profile (top right).\n✦ Click More > Save to PDF\n\n2. Upload to ChatGPT\n\n✦ Open the new ChatGPT-5\n✦ Upload the PDF from your profile\n\n3. Copy & paste this prompt:\n\nPrompt: \"Act like an elite personal-branding strategist and LinkedIn algorithm specialist. Your mission is to re-engineer my LinkedIn profile so it irresistibly attracts [insert goal—e.g., recruiters, clients, networking opportunities]. Step 1: Thoroughly analyze every element in the attached PDF of my existing profile—headline, about, experience, skills, endorsements, recommendations, media, banner image, and public settings—while noting tone, achievements, industry jargon, and gaps. Step 2: Pinpoint and explain any factual inaccuracies, stylistic inconsistencies, redundancies, or outdated information. Step 3: Synthesize a clear positioning strategy that highlights my unique value proposition, target audience, and core themes. Step 4: Rewrite each profile component with SEO-rich, goal-aligned keywords, quantifiable metrics, and compelling storytelling that follows LinkedIn best practices (120-character headline hook, scannable bullet points, first-person voice). Step 5: Suggest Three headline variations ranked by effectiveness. Step 6: Provide a personalized connection request template and a content-posting cadence that reinforces the new brand narrative. Step 7: Deliver a prioritized checklist of next actions (profile settings tweaks, engagement tactics, analytics to monitor) to implement the overhaul. Take a deep breath and work on this step-by-step.\"\n\n4. Get a Full Data Analysis\n\n✦ Click Me (top right on Linkedin) > Settings & Privacy\n✦ Go to \"Data Privacy\" > Get a \"copy of your data\".\n✦ Check \"Download data archive\".\n✦ Then click \"Request Archive\".\n\n5. Upload this file to ChatGPT with this:\n\nPrompt: \"Act like a senior data analyst, LinkedIn network-intelligence consultant, and personal-branding strategist; your mandate is to transform my raw connection data into actionable insights. Step 1 — Ingest and audit the attached dataset containing my LinkedIn connections. Flag and document all data-quality issues. Step 2 — Perform a meticulous manual clean-up plan: specify concrete fixes for each issue, provide examples of corrected rows. Step 3 — Generate descriptive statistics and visual summaries: a ranked list of the top 15 companies employing my connections (include headcount and % of total network) and a ranked list of the top 15 job titles/role clusters (grouping synonyms). Step 4 — Surface non-obvious patterns: industries or geographies that are over- or under-represented relative to my goals, high-influence companies.\"\n\nI wrote a guide to go from 0 to 10,000 followers.\n\nTo access it, visit this website → how-to-lkdn.ai",
  "word_count": 426,
  "metrics": {
    "total_reactions": 967,
    "likes": 772,
    "love": 61,
    "insight": 103,
    "celebrate": 19,
    "support": 12,
    "funny": 0,
    "comments": 178,
    "reposts": 112
  }
}